[
    {
        "comment": "Hey dude should I have to have a master’s degree or a doctorate in order to work as a data scientist or not?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello sir... Hope you great, I'm from India in southern part, i saw your comment section your really good to reply at all, it was very nice.... Sir I'm passionate to start my career in data related fields because i love to uncovering the hidden information, so i start to prepare from myself, but in India the data science fields are to get a job is very difficult because they need much more expertise person, im from very middle class family, I can't affer lot of money for some course and certification, but I'm really passionate to work in data fields, now what i do sir, how to land my first job in this data field, in other hand the AI also destroy the employee, so give some suggestions, for my career and what can i study sir...",
        "compound": 0.907,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Note : Sorry for my poor English 😅",
        "compound": -0.2263,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thankyou Sir",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "You’re a legend Ken! ❤",
        "compound": 0.6696,
        "sentiment": "positive"
    },
    {
        "comment": "Time to develop your skills in the bitcoin ecosystem!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "can you please update the video that explains how to create data science portfolio with hugo ?",
        "compound": 0.5267,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you Ken for everything that you have done for me and the community! In my eyes, you were the first to start creating great Data Science content and gave many people their start both on YouTube and professionally!",
        "compound": 0.855,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'd love to reconnect one of these days! I'm looking forward to your return to making content when the time comes!",
        "compound": 0.6988,
        "sentiment": "positive"
    },
    {
        "comment": "I see this late, but glad you made a video about it Ken! Happy for you my friend. I wish you the best with the new podcast!",
        "compound": 0.9783,
        "sentiment": "positive"
    },
    {
        "comment": "Excited to see this new content!",
        "compound": 0.4003,
        "sentiment": "positive"
    },
    {
        "comment": "It’s very brave of you to follow your love for sport and make the change you want to make! You are one of the people who have inspired me to create content on YouTube. Thank you and I’m excited for Exponential Athlete episodes 🤗. All the best for everything you’re planning to do! ❤️",
        "compound": 0.9776,
        "sentiment": "positive"
    },
    {
        "comment": "Good Luck 👍",
        "compound": 0.7096,
        "sentiment": "positive"
    },
    {
        "comment": "The content that you have created as an educator/creator has immensely impacted not only those in the data domain but also the general audience as the new Exponential Athlete podcast is generally applicable that we can adapt not only for sports but also for studies and for work. Congrats Ken on your next endeavor, I'm rooting for you, my friend!",
        "compound": 0.8932,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for all your help getting me started with Data Science back in 2020. It gave me the foundation to achieve some pretty cool experiences and feel confident in my skills 🙏🏾",
        "compound": 0.9231,
        "sentiment": "positive"
    },
    {
        "comment": "Loved your honesty Ken..",
        "compound": 0.7964,
        "sentiment": "positive"
    },
    {
        "comment": "You were one of the few creators who inspired me in my early stages and I wish you the very best in everything you do 👍❤️",
        "compound": 0.8858,
        "sentiment": "positive"
    },
    {
        "comment": "Great video",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Personal and career growth as a result of self reflection? Always respectable, Ken. Haven't listened to all of them but you're very clearly enjoying the hell out of the Exponential Athlete so why not? :D",
        "compound": -0.1938,
        "sentiment": "negative"
    },
    {
        "comment": "Ken you videos , content and course helped me a lot in my data journey.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I learned so much from your channel when i was a fresher and your project series actually helped me land a job and right now i have 3 years of experience so really thankful for all content, time and effort you have given to data community through your channel.",
        "compound": 0.6453,
        "sentiment": "positive"
    },
    {
        "comment": "All the very best for your future and we are always here for you!!!!",
        "compound": 0.7691,
        "sentiment": "positive"
    },
    {
        "comment": "Like it or not time does lay a path in front of us. What I mean by that is today we choose our best path based on our past and what we hope for our future. As time clicks forward, our current today is becoming exponentially different from your yesterday, making yesterday's choices diametrically different from our todays realities. In my case, I started as an art student, became a fashion designer, who looked at that landscape and chose to be a small business owner, who then saw technology would rule this domain, educated myself in the ways of programming and database design to build my own on-line business, only to realize after 25 years of success that the inventory investment to grow at the rate necessary for success was more than I wanted to commit to, leading to going back to school to get a formal education in Data Science from UC Irvine, which has led to now starting my new career as and Energy Analyst at the California Energy Commission. My advice is to stay connected to today's reality and be open and agile enough to update your best choice for your best future, cause guys I guarantee you its going to change so you might as well enjoy the ride. Bravo Ken for staying connected to your reality! I am looking forward to watching your next chapter.",
        "compound": 0.9894,
        "sentiment": "positive"
    },
    {
        "comment": "Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "As one of the first OG Data Science Youtubers, you've had a tremendous impact not only on the community at large but also on my journey.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I remember first watching your content when struggling to learn everything in this field and then you made me feel like this was possible. I remember saying to myself: \"Heck, if Ken can do this, so can I\"😜",
        "compound": -0.0772,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Super stoked for your next journey with the Expontial Athlete; I can already see the passion in the episodes you've made so I have a feeling this is gonna be epic!",
        "compound": 0.8268,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks again for all your mentoring my dude. 🤙-Luke",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I got into the field heavily thanks to your content man. I always appreciate! You can't imagine how many lifes you have touched upon :)",
        "compound": 0.8356,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks a lot and also best of luck with the new projects!",
        "compound": 0.8858,
        "sentiment": "positive"
    },
    {
        "comment": "Great to see that you're making changes based on some internal reflection and deciding what value you can provide to others. Looking forward to the new videos!  Sharing real experiences is great. Sports and performance are closely related to data science too - not for everyone but definitely worth checking out.",
        "compound": 0.8999,
        "sentiment": "positive"
    },
    {
        "comment": "I hope you're still familiar with papaya.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I need tennis maths now pls!",
        "compound": 0.1511,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks so much for all your videos in the past, wish you luck in your next endeavors. Thanks to you and your videos I was able to transition to a DS role and it changed my life forever. Just know that your videos did impact people's lives, I'm a testament to that!",
        "compound": 0.8955,
        "sentiment": "positive"
    },
    {
        "comment": "Good luck in your new venture!!",
        "compound": 0.7568,
        "sentiment": "positive"
    },
    {
        "comment": "Ken, I admire your honesty and vulnerability. Very inspiring! I am sure this decision was not easy but I love that you are following your heart and passion. Cheers to the next chapter, I will be rooting for you 🎉",
        "compound": 0.9838,
        "sentiment": "positive"
    },
    {
        "comment": "Can you do an analysis of a sport (i like soccer or basketball but any game will be enjoyable) from a game theory point of view?",
        "compound": 0.6808,
        "sentiment": "positive"
    },
    {
        "comment": "Best of luck Ken. I'll definetely check your sport's podcast. In my life i dedicate much of time to sports as much as to data (that pays the bills). Would be great to have some content regardind sports analytics;",
        "compound": 0.9062,
        "sentiment": "positive"
    },
    {
        "comment": "RIP 🥲",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Dude, that was SO heartfelt. Appreciate everything you've done for the community.",
        "compound": 0.8774,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I owe you a huge debt of gratitude for being a waymaker in the data career space and the content creation space. Cheers to the future.",
        "compound": 0.8074,
        "sentiment": "positive"
    },
    {
        "comment": "Glad to hear you not getting sucked into the AI hype vortex. Everyone seems to be covering AI news, and it’s just very noisy content.",
        "compound": 0.5403,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "AthleteX, on the other hand, looks like an original and promising use of time. (Been loving the Kobe commentary). I’ll be watching!",
        "compound": 0.9312,
        "sentiment": "positive"
    },
    {
        "comment": "Appreciate the honesty! Good luck on your new venture man!",
        "compound": 0.9078,
        "sentiment": "positive"
    },
    {
        "comment": "Best of luck with this Ken",
        "compound": 0.802,
        "sentiment": "positive"
    },
    {
        "comment": "Best of luck in your new projects Ken!🎉",
        "compound": 0.8805,
        "sentiment": "positive"
    },
    {
        "comment": "Everything grows and I am looking forward to the new content",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Appreciate the honesty, and can't wait to see the channel evolve and how exponential athelete plays out!",
        "compound": 0.8016,
        "sentiment": "positive"
    },
    {
        "comment": "❤❤❤❤ you done awesomely well thanks",
        "compound": 0.9712,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the candid video, I was worried you’d be leaving YouTube, but glad to know you’ll still be around. You’re a huge inspiration to me and the reason I’m pushing forward with a masters degree in DS. You’ve helped me start my first Kaggle competition and change how I viewed the field of data science. Excited to see what’s coming",
        "compound": 0.9432,
        "sentiment": "positive"
    },
    {
        "comment": "Seeing the evolution of you and this channel over the years has been amazing. Best of luck to ya and always supporting from the sidelines!",
        "compound": 0.9348,
        "sentiment": "positive"
    },
    {
        "comment": "Funny. No more than a week ago, I was driving and randomly thought, \"I haven't seen Ken post a video in a while.\"",
        "compound": 0.1779,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "No idea if this is a good idea or not, but Billy Walters,  who is the greatest sports gambler of all time might have some insight into many analytics you're looking for as he assigns a point value to every athlete that matters in a sports outcome. He might have both tangible and intangible aspects that athletes possess that help them be a better athlete. If you could get him to open up as he has been willing to do recently as he looks to pass his legacy on, you might get some of what you are looking for.",
        "compound": 0.9571,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Will definitely follow that project as well!",
        "compound": 0.6239,
        "sentiment": "positive"
    },
    {
        "comment": "Hey man, I think it’s amazing you’ve made a change after some personal reflection!",
        "compound": 0.6239,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Even by doing that you’re giving us viewers inspiration to do a similar exercise for ourselves. Good luck with everything ahead 🎉",
        "compound": 0.9246,
        "sentiment": "positive"
    },
    {
        "comment": "I'm looking forward to whatever happens next with this channel. All respect to you, man!",
        "compound": 0.5255,
        "sentiment": "positive"
    },
    {
        "comment": "Have always enjoyed your stuff dude, even managed to land my first data engineer position a few weeks back! All the best with whatever you choose to do moving forward.",
        "compound": 0.8313,
        "sentiment": "positive"
    },
    {
        "comment": "good luck Ken",
        "compound": 0.7096,
        "sentiment": "positive"
    },
    {
        "comment": "Admirable honesty and humility. Much luck on your journey",
        "compound": 0.8689,
        "sentiment": "positive"
    },
    {
        "comment": "Just parking out of love.",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for watching everyone. I felt like it was the right thing to do to update all those have followed me this far with the new changes going on in my life. I'm extremely excited about my new direction even though it means I'll be taking some time off from this channel that I've been working on for the last 5 years. I wish you all the same sort of luck and encouragement following your own passions!",
        "compound": 0.9571,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for watching! What is the answer to my secret question?",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "Also, thanks to RaskAI for supporting the channel check out their awesome translation platform here: https://bit.ly/rask_ken Use \"KEN20\" for 20% off!",
        "compound": 0.8805,
        "sentiment": "positive"
    },
    {
        "comment": "ANYONE THAT IS MARRIED SHOULD TAKE AN IQ TEST.NOW WHEN IT COMES TO ABORTION NO IQ TEST OR DNA TEST IS NEEDED ONLY UNLESS THE FATHER IS CONCERNED WITH THE HAHAHA. ANY MAN THAT WOULD GO TO THE COURT OF LAW TO STOP AN ABORTION SHOULD BE CHECKED INTO A ONE WAY RETARD  SANCTUARY.",
        "compound": -0.4939,
        "sentiment": "negative"
    },
    {
        "comment": "Down voted for blabbering and not getting to the point",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Sorry for disturbance I has a question about From where to start to become data scientist For example which institute are good in india",
        "compound": -0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "you looked sma",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "rter before you started talking",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What do you think of studying a double major in data science and information technology?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Loved the analysis, very detailed on the things that chat GPT is good at doing; which shows how important we have to be mindful of the tasks we give to it and the answers it generates. Thank you for the video👍",
        "compound": 0.8779,
        "sentiment": "positive"
    },
    {
        "comment": "Phew 😅that was a close one 😂",
        "compound": 0.6597,
        "sentiment": "positive"
    },
    {
        "comment": "If you want to take legit online IQ test try danish and norwegian websites of mensa - scores from those tests have very strong correlation with official mensa tests. Also: there are no different types of intelligence. It's an interesting idea, but it has been debunked.",
        "compound": 0.5785,
        "sentiment": "positive"
    },
    {
        "comment": "You've always been Ken Jeenius for us 🌻 Also btw that IQ ranking video was suggested to me right after the end of your video 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I'm glad tho it seems this type of tests has not been a huge part of the model training behind ChatGPT",
        "compound": 0.2589,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken. The secret question in Spanish is ¿Eres más listo que ChatGPT? Thanks for the video!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "If you want to actually learn about IQ I would recommend talking to a psychologist instead of researching consumer web-based IQ products.  When a psychologist tests for intelligence they use the Wechsler Adult Intelligence Scale version 4. This test is administered in person, and ChatGPT couldn't do it because you need to have a physical body to take the test.  If we research the embodied nature of cognition (see Metaphors we Live By - Lakoff) we learn that human cognition separated from the body is impossible - which makes us wonder what we would be measuring with the intelligence of a bot",
        "compound": 0.9022,
        "sentiment": "positive"
    },
    {
        "comment": "Interesting. I did a quite extensive IQ Test too and it scored 65, which was honestly quite underwhelming. I used GPT-4-Vision and German language and it did 0/10 tasks correct in the math category.",
        "compound": 0.6908,
        "sentiment": "positive"
    },
    {
        "comment": "Is the lecture you gave at the event online anywhere? I’d be interested in listening",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "You're an inspiration my friend! Truly outstanding, and MAN am I #jealous....what a sweet opportunity!! Awesome!",
        "compound": 0.9766,
        "sentiment": "positive"
    },
    {
        "comment": "Oooh, phenomenally put together video, Ken. Lots of good tidbits, and yes, awesome work by SAS.",
        "compound": 0.8658,
        "sentiment": "positive"
    },
    {
        "comment": "So cool, Ken!!",
        "compound": 0.49,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That chip-in at the 9:08 👀👀",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I have some particular insight into SAS (Statistical Analysis System) software. My dad works as a business analyst contractor and have 20+ years of SAS experience. He pretty much now only accepts jobs that look for strong SAS proficiency because not many people have that. Thus, when he manages to land a contract, he tends to be very highly valued. On the other hand, such roles are harder and harder to come by because everyone now is switching over to Python.",
        "compound": 0.9379,
        "sentiment": "positive"
    },
    {
        "comment": "I know I'm not alone in saying I'm glad you chose data science over your golfing career 😜",
        "compound": 0.5775,
        "sentiment": "positive"
    },
    {
        "comment": "“Innovation is not going anywhere! #wisdom Ken - gratitude sir!",
        "compound": 0.2751,
        "sentiment": "positive"
    },
    {
        "comment": "Impress with that man, keep it up",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I am impressed, and enrolling into 365 data science course.",
        "compound": 0.4767,
        "sentiment": "positive"
    },
    {
        "comment": "Let’s go Ken!!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Ken jee. Love you man.",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Special thanks to SAS for making this experience possible!",
        "compound": 0.7088,
        "sentiment": "positive"
    },
    {
        "comment": "How can one get started with contracting Kenny?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Is the contracting trend just in tech, or in all days science domains?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "As a freelance Data Scientist, I confirm this is true!",
        "compound": 0.6476,
        "sentiment": "positive"
    },
    {
        "comment": "Let's go , with how to get started !",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am a student how can I start a contract job sir",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Make video on stable diffusion and Emad mustaque and its impact on data jobs?",
        "compound": 0.296,
        "sentiment": "positive"
    },
    {
        "comment": "Interested in the topic ☺️!",
        "compound": 0.7177,
        "sentiment": "positive"
    },
    {
        "comment": "Full-time jobs pay severance. Contracts can be ended on the spot and without the chance to switch to a new team.",
        "compound": -0.2824,
        "sentiment": "negative"
    },
    {
        "comment": "Would love you to create a video on how best to switch from full time work to contract/ freelancing asap!",
        "compound": 0.9041,
        "sentiment": "positive"
    },
    {
        "comment": "I got my first role in Data science about 6 months ago",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "And  recently started looking at working on contracts, though I relaxed because I learnt it could be a bit challenging to start as it is a demanding environment, its usually straight to delivery....",
        "compound": 0.5859,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I really enjoy my current company, the manager and the team, I'm learning a lot of new things (good for me) and I appreciate they took a chance on me to allow me start with my visa limitations. My pay is around what is obtainable in my region for a level 5 but its difficult meeting my needs as a family man so I sometimes have to do other menial jobs to patch it up. What do suggest I do, I recently bagged my Ph.D. which should come with its own benefits",
        "compound": 0.7137,
        "sentiment": "positive"
    },
    {
        "comment": "Yes, please make a video on how to get started in contracting",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "Would love a video about contract work, especially from the POV of a FTE.",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "I've been recently fired after over 5 years. The only one reason was 'cost reduction', so I couldn't agree more with all arguments presented in a vid. Many thanks, Ken for your work.",
        "compound": -0.7216,
        "sentiment": "negative"
    },
    {
        "comment": "Thanks for the video, Ken! Your insights are greatly appreciated. I'm excited to learn how to get started.",
        "compound": 0.8573,
        "sentiment": "positive"
    },
    {
        "comment": "Would love another vdo on contracting...",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Do it!!!!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey Ken, really loved the points, it would be super nice to have a video on how to land your first client. Please do ❤",
        "compound": 0.9545,
        "sentiment": "positive"
    },
    {
        "comment": "Who is the dude in the background not paying attention to this great content going on right in front of them!! 🤯",
        "compound": 0.755,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "On a related note, I lowkey love this quote from Mr.Wonderful \"Salary is the drug they give you to forget your dream\"",
        "compound": 0.6486,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome video Ken, not enough data creators are talking about this!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Like you said the rise of contract work is in many ways a win-win for employees and employers. Employees can have more diversified and flexible income opportunities, while employers can optimize their staffing needs.",
        "compound": 0.8578,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Beyond all that, I feel the flexibility of contract work allows it to be more engaging and fulfilling for contractors.",
        "compound": 0.624,
        "sentiment": "positive"
    },
    {
        "comment": "Great video and insights Ken!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "Absolutely would be waiting to see a video from you on contracting - going to share this with friends, and are you available for one on one mentoring (paid)?",
        "compound": 0.6486,
        "sentiment": "positive"
    },
    {
        "comment": "we need a video on how to get started",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I’m a contractor myself, agree 100% with all points in this video. Can confirm it’s true. I would appreciate another video about this on how to get started",
        "compound": 0.7906,
        "sentiment": "positive"
    },
    {
        "comment": "This was a great video!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am fortunate enough to work as a salaried employee for one of the largest vendors in my industry. No mass layoffs yet (although a hiring freeze), and top mgmt actually seem to care about us. With that said, I do want to explore the option of being a contractor/freelancer. So, please do make a Part 2 on the cons and maybe a Part 3 on how to get started and attract clients.",
        "compound": 0.875,
        "sentiment": "positive"
    },
    {
        "comment": "I think this video is really needed to spread awareness that other ways of work are possible. Thank you Ken, looking to see more from this topic from you",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, it would be valuable for me to get your take on how to build an independent contractor client base. And thanks for this video. It was insightful.",
        "compound": 0.7184,
        "sentiment": "positive"
    },
    {
        "comment": "How can I start as an contractor?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Love this topic. Thank you for making this helpful video.",
        "compound": 0.8735,
        "sentiment": "positive"
    },
    {
        "comment": "I want to know how much experience I need to contract as a data scientist, certifications needed/ recommended, where to find clients, etc.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "I think you made some great points about contracting but I do think context matters a lot",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "1) in the US since your healthcare is tied to employment you're screwed as a contractor with respect to that as well as taxes in a few ways",
        "compound": 0.25,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "2) Contracting and having your income as business income is prudent but getting clients is easier said than done. In a competitive marketplace it will be difficult to differentiate. In your niche you are a super star but that is not the case for most folks I wager.",
        "compound": 0.8338,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "3) Cal Newport talks about digital nomads and how lonliness is a huge issue because one thing about \"9-5\" work and culture is that having time to do things with people and experiences is rooted in our cultural shared schedules. If that doesn't matter to you great but good luck finding people to hang out with on your wednesday off at 3pm otherwise.",
        "compound": 0.9138,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That said I personally DO want to get into either starting a side business or contracting because its a huge blessing for the educational benefits you mention.",
        "compound": 0.8126,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Great vid",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Very informative! Looking forward to next video!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Ive been a data consultant for a year or so now with a couple of clients and the freedom is incredible. Currently though finding new work has been difficult.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Due to many factors, i have been considering the contractor route. This video puts a new light to the matter. Thanks! Also more on the contracting role would be great!",
        "compound": 0.8264,
        "sentiment": "positive"
    },
    {
        "comment": "I would certainly be interested in more contractor related content.",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken Jee THANKS!",
        "compound": 0.6027,
        "sentiment": "positive"
    },
    {
        "comment": "Not sure what is the situation in other countries, but in Slovakia, good luck to fire an employee unless the company is cancelling the position/role. Contractors have to do way more paper work here - taxes and contributions to health and social insurance (which are mandatory and as a employee you can ask your employer to do all of this for you while he cant refuse by the law). On the other hand you are more flexible and have some perks in taxes",
        "compound": 0.9176,
        "sentiment": "positive"
    },
    {
        "comment": "Ahhh, see when I first saw the title I thought you were talking about contract jobs such as ones through temp agencies. Temp agency contract jobs are not what you want. They have all the negatives of being a contractor but no resiliency. These kind of contractors are the first to be let go, often are paid less, receive worse benefits through the temp agency, and still are tied down to just one place of employment for 40+ hours.",
        "compound": -0.5631,
        "sentiment": "negative"
    },
    {
        "comment": "Hey ken i would love to see a video on how to get started with contracts!😊",
        "compound": 0.8883,
        "sentiment": "positive"
    },
    {
        "comment": "Even better when you live in a developed country with universal health coverage! Great video!",
        "compound": 0.8217,
        "sentiment": "positive"
    },
    {
        "comment": "Ken jee is the best tech person I have ever seen in my life ,he is my inspiration❤",
        "compound": 0.9153,
        "sentiment": "positive"
    },
    {
        "comment": "first",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "edit: i need a job",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "edit #2: i need to find more contracting work",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Special thanks to Durable for sponsoring this video! Try it out and build your own website in seconds: durable.co?utm_medium=Youtube&utm_campaign=KenJee1&utm_source=Youtube&utm_content=&utm_term=KenJee1",
        "compound": 0.7088,
        "sentiment": "positive"
    },
    {
        "comment": "Quite insightful been trying to get a DS in the Computer Vision niche been a struggle though.",
        "compound": -0.0772,
        "sentiment": "negative"
    },
    {
        "comment": "I feel this a lot as I am currently transitioning from my customer service role (for the past 7 years) into data analytics. I've been job hunting since June and no luck so far. 92 job applications sent, 6 initial interviews, 1 interview with a hiring manager but no job offer so far. I've done projects  and tailor fitted my resume and cover letter to be relevant to the fields that i am applying to and did pro bono work to have a relevant work experience for my resume, and still nothing. While doing my projects, I've come to love analytics more and more despite the rejections so I am 100% certain about my career shift. However, burnout from the job rejections is slowly creeping in. To add insult to injury, I've seen entry/junior level positions that's asking for 5 years of experience in the field. I just hope to see something positive in my career in this field",
        "compound": 0.7258,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Informative video as always Ken! You have been instrumental in my career shift and journey into data science and analytics. Papaya!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "wow if that graph about the job market is true then that explains a lot about my situation. I graduated college in May so around March-May is when I started getting really desperate for a job and it felt completely hopeless. couldn’t even get anything but automated rejection emails. Spent the summer doing the “upskill” portion of this video, waited tables while living with my parents and working on a portfolio and certifications. around August I started noticing more attention from recruiters, and I finally got a really good job offer in September! Hopefully things work out for me",
        "compound": 0.5773,
        "sentiment": "positive"
    },
    {
        "comment": "❤❤❤❤❤❤❤❤❤❤❤❤",
        "compound": 0.995,
        "sentiment": "positive"
    },
    {
        "comment": "Lowkey kind of a depressing video",
        "compound": -0.3818,
        "sentiment": "negative"
    },
    {
        "comment": "Also wanted to add that data engineer is more similar to backend software developing rather than scientific/gaining insights.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I actually have the stats for my entry level hit rate: 10 interviews/461 applications = 2%",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Senior level hit rate: 23 interviews/36 applications = 52%",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "It gets easier (or maybe I was just lucky the second time around)",
        "compound": 0.6808,
        "sentiment": "positive"
    },
    {
        "comment": "Goddamit I've been sticking this career path since graduation but hit a brick wall twice after 1.contract ended in Dec 2020 and 2. a major lay off Summer 2023. I guess it's my Waterloo in 2020 but come on it can't be twice?!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks Ken this was a very honest update of the DS market",
        "compound": 0.7574,
        "sentiment": "positive"
    },
    {
        "comment": "You can have multiple contracts if you have your own company. That means way more money.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Ken you are an honestly valuable content creator.",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "For data science projects, how much would you recommend creating to make one stand out the most? And what project topics do you recommend? I have no idea which topic I wanna choose rn. From your experience, how long did it take for you to create a beginner data project?",
        "compound": 0.7677,
        "sentiment": "positive"
    },
    {
        "comment": "Very informative and factual as always. Thanks. I have a question, hope I could get some advice from you. I really like the processing, model building, date modeling and mathematical and coding side of data science but hate the reporting and communication side, which is also my weakness point. Which specialized role should I apply for and pursue?",
        "compound": -0.7143,
        "sentiment": "negative"
    },
    {
        "comment": "\"Treat the job search like a data science problem\" 🤯",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Also, I second this recommendation on social media (or just building things)... I'm now fortunate enough that I don't have to apply to jobs and companies typically reach out me.",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "Is there a big difference between logistics and data-related jobs (besides the job title)? I find right now there are huge opportunities in the logistics or supply chain field which all lack good data management and analytics practices. It was the only way I was able to get my foot in the door in the competitive market and use that opportunity to learn and develop.",
        "compound": 0.8402,
        "sentiment": "positive"
    },
    {
        "comment": "There is also quantitative analysts! Don't forget those",
        "compound": 0.2401,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken. Could you please review my resume?",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "This video is indeed very helpful. I concluded many of the points made here on my own over time.",
        "compound": 0.4754,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I also very much look forward to the video on contracting. There are entire courses dedicated to teaching data scientists/ML engineers on how to be freelancers. Although I'm happily employed where I am, I want to at least explore the option of being my own boss someday.",
        "compound": 0.8074,
        "sentiment": "positive"
    },
    {
        "comment": "One of your most helpful videos so far! Straight to the point and real/honest advice. Lost my job two weeks ago. Was not in tech. Graduated with a math degree two years ago. I’ve self studied data science related projects on the side but never did enough studying to get the role in tech. This helps motivate me to just get it done and study hard for the next few weeks. Made a better resume and staying on top of applications. Thanks for everything you put into your channel Ken! Really lifted me up today",
        "compound": 0.9599,
        "sentiment": "positive"
    },
    {
        "comment": "- getting Azure cents helped my callback",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "- gonna upskill / specialize into data engineering self learning",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "- LinkedIn has next to 0 callbacks for me, but Indeed works extremely well",
        "compound": 0.4748,
        "sentiment": "positive"
    },
    {
        "comment": "Thank You So Much for the advice.s It was really really needed.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "I'm embarrassed to admit it but I never gave much thought of observing the statistics of job hunting or the specialization of data science jobs. Thanks for the eye opener.",
        "compound": 0.5423,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! Thanks for this video. It's very helpful. I''d like to watch the contracting videos. I'm starting in data science with previous experience in business analysis, and I'd like to build something and be a contractor.",
        "compound": 0.8897,
        "sentiment": "positive"
    },
    {
        "comment": "Hello Ken, great video. I would like to ask you some questions:",
        "compound": 0.765,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do you think it's possible to create an extra layer of automation to outperform the job market?",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "I don't have a university degree, and I'm not aware of how much of a disadvantage that puts me at. Should I consider bootcamps?",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Furthermore, I'm thinking of starting a DS YT channel, beginning with explaining the basics. Any suggestions before I start?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you very much for your content.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Ken Jee, awesome video! Please, make that video about independent contracts over full time jobs at big companies. Also, talk about freelancer possibilities. Thank you very much!",
        "compound": 0.8906,
        "sentiment": "positive"
    },
    {
        "comment": "I follow the strategy of networking more and applying to smaller set of positions. I much prefer informal networking to formal networking, I wish there was more of it.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "In the first few minutes, your argument looks a lot like the suken cost falacy, but i know it's not",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "🔋🔌💻",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you,  I couldn't wait to watch it but I will watch it again to really consider these advices.",
        "compound": 0.1901,
        "sentiment": "positive"
    },
    {
        "comment": "If you stay at the end of the video, Data Science definitely is for you",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Really nice advice Ken. This helps alot to change the strategy on such a dificult market. Thanks",
        "compound": 0.8399,
        "sentiment": "positive"
    },
    {
        "comment": "01:53 That look literally sent me. Hahaha😂",
        "compound": 0.7579,
        "sentiment": "positive"
    },
    {
        "comment": "is it related to usa market only?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Yay a new job posting! Oh wait, its already got 100+ applications 😅",
        "compound": 0.7345,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "i have done a career transition but I'm worried about my friends who have been laid off that are still trying in data science :(",
        "compound": -0.3612,
        "sentiment": "negative"
    },
    {
        "comment": "interesting",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "When I changed careers and got into data, I immediately knew it was a big mistake. It’s a big black box and no one understands it. Companies have probably been burned and don’t see a point in investing.",
        "compound": -0.5574,
        "sentiment": "negative"
    },
    {
        "comment": "data science is a bubble due to the fucking media hype.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "PAPAYA",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "put cybersecurity on the list",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi ! Thanks for uploading this ! I will be soon in professional retraining to become a data analyst and I’ve started watching videos like yours cause the way to be employed seems to be full of hardships.",
        "compound": 0.717,
        "sentiment": "positive"
    },
    {
        "comment": "I live in France and data driven enterprises are not overwhelming the market yet so I truly hope finding jobs and being employed in future years.",
        "compound": 0.7463,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "FAANG is so overrated. Plenty of jobs out there if you aren't a leetcode tech bro needing validation from San Francisco",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Should i switch to cybersecurity then. i just started getting into data science recently.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Good video. I’d compare it with the rest of the job market though",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "They may be rebounding but they have so many people applying that the market is over saturated. Hopefully, that changes as we go into the fall and into 2024. I’ve been job searching since February and it’s been the worst job market I’ve ever experienced.",
        "compound": -0.4767,
        "sentiment": "negative"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The tech gold rush is over. Anybody telling you otherwise is trying to sell you the shovels.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Only pursue a data science role if it’s something you’re very interested in. There’s many other roles out there where you can make more money, so don’t try to gold rush this sector anymore.",
        "compound": 0.4576,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I think that cs isn't gonna be a valid option from now on. It's been the most mainstream degree for the past 10 years. That happens with every industry. The IT industry was red hot from 1995 to 2000 and then went bust in 2001, Oil drilling was on fire from 2010 to 2014 and is now in dangerous territory. Noone tells students that the real world depends on the capital flow into and out of markets",
        "compound": -0.6705,
        "sentiment": "negative"
    },
    {
        "comment": "😭how can a fresh graduate people to get into industry when such hard time 😢",
        "compound": -0.6486,
        "sentiment": "negative"
    },
    {
        "comment": "Yes, please to a video on the contract side of things. Contract roles have been the bulk of more promising job interaction my friends have had over the last 6 months and I'm curious if they are the new norm (along with offering no benefits). Thanks for all the great information! Be well",
        "compound": 0.936,
        "sentiment": "positive"
    },
    {
        "comment": "I'm a hiring manager here in Chicago, this is not been my case at all",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Interview query CEO is a great guy. One of my friends worked for him and I got to chat with him a few times. He’s really a gem of a person. His LinkedIn posts, on the other hand, ….",
        "compound": 0.886,
        "sentiment": "positive"
    },
    {
        "comment": "Eyy! I was one of the people from Reddit that you shared who was able to get a data job recently! Good luck, everyone! <3 It took me MONTHS of rage applying and tons of phone calls/interviews. You got this!",
        "compound": 0.8302,
        "sentiment": "positive"
    },
    {
        "comment": "I am unemployment. My english is not fluent. I have to find a tech job in 3 months. Which one is better for finding job these days in texas, frontend or data analyst?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "600 applications, BSc, MSc, 2 yoe, 3 Interviews, no job.",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Definitely  interested in your thoughts on what contractor means today",
        "compound": 0.6597,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I think that to make a statement you have to also analyze the demand for jobs. For example, we now know that because of the massive layoffs in tech there is a new pool of thousands of experienced and competitive data scientists competing for the jobs. I think the data at least should include the number of applicants per job overtime.",
        "compound": 0.128,
        "sentiment": "positive"
    },
    {
        "comment": "The issue I find is that they are hiring a junior but they want the experience of a senior. All the “entry level” jobs I find request 1-3 years of experience. Out of almost 70 applications I have only gotten 3 interviews, well I’m about to do the third this week and I hope it works out. Out of all of them I could only get data entry types even though I have a data science degree. Though I’m hopeful that I will find something eventually, I work on projects so I can have experience",
        "compound": 0.9081,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I was thinking of starting a data science degree next fall... Should I reconsider? :/",
        "compound": -0.34,
        "sentiment": "negative"
    },
    {
        "comment": "There is saturation in the market but also heterogeneity in the profiles.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The more there will be people looking for jobs, the more employers will use severe criteria to select who they want.",
        "compound": -0.3182,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Having a masters works better than bootcamps and self taught skills. Having a portfolio works better than just having a good cv. Having some topic expertise on the data at hand (some behavioral science skills, or marketing skills...) is better than being a pure data scientist. It's not about being actually better... but about seeming more adequate to a recruter.",
        "compound": 0.8919,
        "sentiment": "positive"
    },
    {
        "comment": "Hello, I am studying a BS in physics with data science as a minor. I want to get into employment as data analyst right after graduation (I have 2 more years left). What is your best advice?",
        "compound": 0.6705,
        "sentiment": "positive"
    },
    {
        "comment": "thanks for share those useful papaya info",
        "compound": 0.7906,
        "sentiment": "positive"
    },
    {
        "comment": "I would to add there’s a rise of job posts for Analytics Engineer.  The duties and responsibilities are a mix of data engineering, BI, database management, and data analytics.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I work for a big consulting company, we are saturated with Data Scientists and analysts, most of our data engineers are off-shore (think India and other countries with ample talent) and there has been a steady push to leverage off-shore resources more due to clients price sensitivity (Off-shore gives clients cheaper fees and gives the consulting firm better margins). The only consulting positions related to data in consulting that are substantially recruiting is work for government contracts that often require clearance and require the employee to be a citizen. The largest need for data people in consulting rn are not function specific people who do data science or engineering but those who are considered SMRs in specific technology stacks imo. Also comes with the caveat that you need strong soft skills in addition to your data skills so not for everyone.",
        "compound": 0.8074,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Finance is hiring a lot right now and they have their pick from the best data talent.",
        "compound": 0.7906,
        "sentiment": "positive"
    },
    {
        "comment": "Data job is not necessary in companies",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "How many of those “non senior” roles have senior role job descriptions? Lol",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "The number of data analytics recruitment is increasing in Canada actually. So, I guess, if you apply to data analytics roles instead of data science roles, you're more likely to get a job.",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "its the same in Software eng. but software in pharma is not impacted, I am sorry I left a job in Pharma couple of years back.",
        "compound": -0.1154,
        "sentiment": "negative"
    },
    {
        "comment": "+1 to the contractor video. Right now it seems like the rates for contract work aren't great although some of the contractor firms offer benefits to offset that.",
        "compound": 0.2037,
        "sentiment": "positive"
    },
    {
        "comment": "papaya?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Actually insightful, well done",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "consulting contract start at june and yes this is seasonal change if what you say is true. from the BPO where most jobs are moved to in ph",
        "compound": 0.6705,
        "sentiment": "positive"
    },
    {
        "comment": "Love your video, I'm from a 3rd world country Nigeria 🇳🇬, started coding python when I was 15 but wasn't consistent because of crypto trading, tho I have a degree in CS.",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I learnt data analysis last year but I had to switch out very fast to become a full stack web developer (something I have experience in) I honestly wanted something that's not really technical and won't stress me ... Truth is data analysis as a career is overrated, I feel into the hype...",
        "compound": 0.8735,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Data analysis should be an ad-hoc skill in any field, I feel career prospects in data analysis is pretty low.. Data scientist and data engineering is wayyyy better for someone looking for stable job, stable pay and career prospects",
        "compound": 0.886,
        "sentiment": "positive"
    },
    {
        "comment": "Physician, Heal Thyself!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya, I've heard of the September Surge, so I am looking forward to that being a positive trend!",
        "compound": 0.5983,
        "sentiment": "positive"
    },
    {
        "comment": "I think one opinion that might help also is scaling up to roles where data can be applied to other fields. Like theres a difference between physics and industrial physics.",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Please do a video of your views on modern contracting and market impact on number of contracting jobs.",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Папая? 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "great",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "A lot of companies over-promised on data science return on investment and since the outcome didn't meet the hype they have cut jobs.",
        "compound": -0.2732,
        "sentiment": "negative"
    },
    {
        "comment": "I feel not enough analysis takes geography into consideration. The job market in a place like Boston could be completely different then somewhere like Denver.",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "Companies realized that what they primarely need are Data Engineers, not scientist or analysts.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What is the rate of fake job posting?",
        "compound": -0.4767,
        "sentiment": "negative"
    },
    {
        "comment": "Data science is dead , long live Machine Learning Engineers",
        "compound": -0.6486,
        "sentiment": "negative"
    },
    {
        "comment": "But  we already knew what you will show & your  conclusions  were already  predictable , no ?",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "I.e Data field is expanding?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I was affected by massive layoffs as a former Big4 tech consultant. I earned the title Senior Data Scientist but it seems like I am overqualified for the positions in the market. I positioned myself to focus on social media and build my own LLC, Originality Works LLC. I want to see how it goes being on my own but for now, the job market seems terrible.",
        "compound": -0.1901,
        "sentiment": "negative"
    },
    {
        "comment": "Papaya 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Good thing about being a data professional, you can analyse why you are jobless from the data available.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the update, Ken! Also, would love to see your new definition of “contractor” for data jobs. Thanks",
        "compound": 0.8832,
        "sentiment": "positive"
    },
    {
        "comment": "Same with the US housing market:  bottomed in the fall of last year and now on the rebound.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya🫶🏻 As a college freshman studying Data Analytics and Computer Science, it’s hard to keep myself motivated with all those news headlines…",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the insight and motivation!!",
        "compound": 0.7081,
        "sentiment": "positive"
    },
    {
        "comment": "The solution is simple, just let the bubble pop. Companies are seeking for thousands of seniors DS/Engineers/… and of course the current job market cannot supply that amount of professionals right now. And without giving opportunities to new comers, it will never be. Companies are right now in the Egg and Chicken dilemma. Once companies realize crazy salaries doesn’t justify anymore super seniors professionals, then they will give another change to juniors",
        "compound": -0.031,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "As a full stack software engineer who feels concerned that LLMs and generative \"AI\" are a significant factor behind the downturn in demand for software dev roles, I have to admit... I'm kinda surprised to hear that demand for data scientists has dropped so much as well. I figured that you folks would be in super high demand right now.",
        "compound": 0.7888,
        "sentiment": "positive"
    },
    {
        "comment": "The company i work for stopped hiring experienced engineers around the end of last year. We have ONLY been hiring college grads pretty much all year.",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "How about the data jobs in India?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Pappaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What happend in may tho?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What is the best way to learn deep learning fundamentals via implementation (let's say pick a trivial problem of build a recommendation system for movies) using pytorch in Aug 26, 2023?",
        "compound": 0.34,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya! :)",
        "compound": 0.5093,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I feel like chat gpt can do 80% of data work if you prompt it right.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "I have over 700 applications bro, 3 years of experience and the \"Google Data Certificate\" and a Bachelors degree, wish me luck boys",
        "compound": 0.6908,
        "sentiment": "positive"
    },
    {
        "comment": "P A P A Y A",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "M-icrosoft",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "M-eta",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "A-pple",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "G-oogle",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "A-mazon",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "T-elsa",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Great video, would love more videos covering the topic",
        "compound": 0.8519,
        "sentiment": "positive"
    },
    {
        "comment": "Finance and healthcare are two domains im interested in applying ds too. Im enrolled in courses thru Coursera on these tppics",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Idk is this cuz chat gpt",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "Looks like it’s also possible that the Fang group is preparing for or currently integrating localized version of ChatGPT so they are firing to do more with less. Because business. Lol.",
        "compound": 0.334,
        "sentiment": "positive"
    },
    {
        "comment": "Big tech is all that makes the news and people tend to incorrectly extrapolate this to every other industry. It's not surprising but thankfully incorrect. My life hack here is to pay zero attention to \"the news\". 😂",
        "compound": -0.04,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey, Ken. Great video! For my own experience, I've extended 3 job offers for data scientists in the last 12 months, I am in the Fortune 300-level insurance industry.",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "As data engineer by Accenture I can confirm even by us there is massive decrease of new job postings and there were even some lay-offs in my platform because of contracts decrease (especially by on-premise tech stack like Oracle). The market is on the lowest point since I entered the business approx. 11 years ago. Now is not a good time to search for a job or to switch just like that (ofc some offers cannot be refused 🙂) Anyway I get like 10 offers a month only on Linkedin alone (and I am not superman), so data engineering is still great in demand.",
        "compound": 0.8266,
        "sentiment": "positive"
    },
    {
        "comment": "I talked to a local recruiter in one of the EU countries. The same situation is here. Companies were firing a lot during winter and spring, and now they are slowly starting to recruit. So, just keep calm and wait. The situation should change sooner or later.",
        "compound": -0.0258,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "For data people looking for a job, rather than doing your 20th coding based udemy course, do some on business and or seek some type of business certification. Especially if you’re interested getting a data gig with a consulting firm.",
        "compound": 0.4522,
        "sentiment": "positive"
    },
    {
        "comment": "Another thing is as data skills become more in demand, many jobs don't have the title of \"data _____\" but the jobs themselves are heavily data focused. So rather than searching for a data title, try look for data job descriptions.",
        "compound": 0.4608,
        "sentiment": "positive"
    },
    {
        "comment": "papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'm definitely interested in hearing your insights redefinition of the modern contractor. I've been doing some contemplation about this as well",
        "compound": 0.7579,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for helping out and diving into the data, Ken!!",
        "compound": 0.717,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I've been getting a lot of questions about the job market so it's interesting to see these insights of the downtown in May to the increase during the Summer. Things are looking good for us Data Nerds!! 🤓",
        "compound": 0.7624,
        "sentiment": "positive"
    },
    {
        "comment": "What is de inflow of new data scientists? Because I think the supply is increasing very fast while the amount of jobs stay stable.",
        "compound": 0.296,
        "sentiment": "positive"
    },
    {
        "comment": "This same thing happened a decade ago when everyone and their brother thought a 3 month boot camp was the golden ticket to a six-figure FAANG job. The surge of YouTube channels during the pandemic pushing the narrative that all you need is to learn a little SQL and Python and you're on your way to a half-a-million-dollar-per-year dream job working remotely has ruined expectations. The market (and Reddit in particular) is flooded with inexperienced/low-experience ANALYSTS who want to call themselves scientists or engineers.",
        "compound": -0.2023,
        "sentiment": "negative"
    },
    {
        "comment": "Very timely information. I moved from Australia to the US and have had a difficult time finding anything. It really is difficult to start over in another country with no established network. I've heard job searches are traditionally slower in the summer due to people being off on holiday. but have been getting more pings from recruiters recently. The info about roles was helpful as I've felt like a chameleon not sure whether to focus on DE, DA, or DS roles or even my old role of BA and QA. I also have degrees in CS and DS.",
        "compound": 0.4798,
        "sentiment": "positive"
    },
    {
        "comment": "What tips you want to give to beginners??",
        "compound": 0.168,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya, I have been trying to move from education into data analysis since last November. I started applying for jobs in March. I had many interviews up until June, then absolutely nothing since. It just died.",
        "compound": -0.5574,
        "sentiment": "negative"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "So much hype for Data Science got busted !",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "haahhaha papayaaaaa :-0",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "papaya!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks for the content! I've been studying data science for a few months and I'm about to build my portfolio, even though I lack formal degrees. My top priority is strengthening my profile for remote work availability. Should I apply to similar sectors as well? Is it advisable to pursue job opportunities that list educational requirements, even if I don't have them?",
        "compound": 0.8736,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "Never underestimate the power of networking. I feel like the luckiest guy alive right now, I applied to a total of 5 jobs after my bachelor graduation in CS and thanks to a friend I met at my university from Spain who was already working in a big agency, I was able to get a data analyst & programmer remote position in his company.",
        "compound": 0.9431,
        "sentiment": "positive"
    },
    {
        "comment": "heh Ken are u referring to the Canadian job market which is so comeptitive? It seems that there not enough jobs available...",
        "compound": -0.1531,
        "sentiment": "negative"
    },
    {
        "comment": "I've seen the Capital One data analyst surge over the past 2 months - my coworker and I both had recruiters reaching out about Cap1 roles.  They had just laid off a ton of agile people a few months back, so that was interesting.  They are one of the largest employers in my area (Richmond, VA)",
        "compound": 0.5809,
        "sentiment": "positive"
    },
    {
        "comment": "What about machine learning?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you Ken for the video 🌻 🥭 (I didn't find the papaya emoji on my phone, but I like mangos)",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "I see data analysis as a skill, not a job. You need to have that skill to do other type of jobs, like Technical Project Manager.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That's good. We can see the impact of data YouTubers on the market.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "As a data scientist in healthcare rather than tech, I remember hearing about all the layoffs broadly, but I never saw them in my own field. Consider applying to hospitals, especially university hospitals.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for the insights. Looking forward to your next video on this topic",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I think people should broaden their search on what types of data jobs they are looking for. Data Science and Data Engineering are more advanced roles...it may help to go after adjacent roles like Data Analyst, DBA, python dev, Web Development, SQL Dev, IT Support/Admin, etc",
        "compound": 0.7574,
        "sentiment": "positive"
    },
    {
        "comment": "Papaya",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'm pursuing a bachelor's degree in computer science (my aspiration is to be a data scientist). Basically, in order to survive in the 21st century world of data, you have to know how to build the technology, manage it, implement it, and monetize from it.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "These companies used all of the talent available to build their infrastructure and the talent was discarded.",
        "compound": 0.4939,
        "sentiment": "positive"
    },
    {
        "comment": "i think people shouldn’t focus on trying to get a data job. so much data online, just learn the skills and do projects in your own time",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for sharing this great topic.",
        "compound": 0.88,
        "sentiment": "positive"
    },
    {
        "comment": "Subscribed like a few min in... You nailed it on the head and respect for the podcast too. I'm sick of these AI videos talking in monotone about basic level content for nearly every topic. AI in healthcare is interesting - I work in mental health and my company works at a national level for suicide prevention and we are rolling out in a couple ways; including for quality assurance of recorded conversations to identify statements that match identifiers (Lyssn). There may be other ways leadership is looking to integrate AI. I just started at a local Intel/Dell AI Workforce program and hope to branch into AI. I live fairly close to Oregon State University and their AI program has a massive investment from NVIDIA founders for a dedicated research building. Really excited to see where this field takes me. Thanks for the inspiring work here!",
        "compound": 0.938,
        "sentiment": "positive"
    },
    {
        "comment": "Many thanks for this insightful and thoughtful video!",
        "compound": 0.6996,
        "sentiment": "positive"
    },
    {
        "comment": "What about Finance?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Awesome video! Totally agree. I think one thing you didn't cover but will likely change is movies and TV shows. I think there will be several developments.",
        "compound": 0.5773,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I think, like you mentioned, barriers to entry will drop so low budget movies will be able to look amazing. This will lead to lots of niche content with strong followings.",
        "compound": 0.6964,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I also think that big budget movies will use AI to let people change movies to suit audiences better. This will start with something basic, like using AI to create a child-friendly version of a movie where nudity, violence and profanity is taken out. It'll also be used for dubbing.",
        "compound": 0.34,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "But it will go crazy when people start watching movies where they deep fake their faces onto it so they can watch the Avengers but it's you, your mates and your families in the movie and the characters actually look, sound and maybe even act like you.",
        "compound": -0.6124,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I also think that content creators will start building out the extended universe of TV shows like Star Wars. These won't be canon but it makes sense to let people take the IP and make their own fan pics and then pay a cut to the corporations that own it. There will be restrictions about how they can be used (i.e. no Star Wars porn parodies using AI to use the original cast) but it seems inevitable and makes business sense as the best stuff will make them money and everything else costs nothing. They can probably remake the best content and not even pay the original creators if they find something is working. Basically crowdsourcing blockbusters (I don't think that would be fair but that is very separate from whether I think it'll happen).",
        "compound": 0.9724,
        "sentiment": "positive"
    },
    {
        "comment": "I've always thought that education was a bubble waiting to pop, so it makes total sense that AI could be the pin that pops it!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Why didn’t u just list them out instead of putting the pics only in the thumbnail, put pics and name in thumbnail in list format",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Well customer service will be interesting because small businesses are a huge chunk of the market and you can't really use AI on tiny data, so I don't know how useful chatbots will be for small businesses in general. I use chatgpt daily and it struggles on anything that doesn't have a lot info/written about it. Also chatgpt still struggles with vague questions or sentences where as a human would either understand the ask or likely ask for further clarification where as AI tries to be a chad and answer based off incomplete information/sentences creating a terrible customer service experience because then you either have to reask it or think its correct when its going in the wrong direction (no real fault of the AI but really just an issue with the user input). I would say AI still has a ways to go and like most cutting edge tech is always \"10 years away from being good\" LOL.",
        "compound": 0.7968,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The CEO of OpenAi/chatgpt made an interesting comment saying the limit of AI might have been hit and that might take some really difficult/interesting  methods for it to even get marginally better. If that is even remotely true we might be seeing a flat line of AI growth, and I would say its like Telsa's auto selfdriving that came out (in what 2014? That's almost a decade old now) and still hasn't progressed like everyone thought. We were all suppose to have self driving cars and truckers and uber drivers were suppose to be out of job etc etc by now.",
        "compound": 0.8778,
        "sentiment": "positive"
    },
    {
        "comment": "Either way you slice it my former industry ‘Play Pro Ball’ is undisrupt-able by AI",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Very interesting video.",
        "compound": 0.4576,
        "sentiment": "positive"
    },
    {
        "comment": "I have a question for you though.......",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Would ai decrease data science or sd/se jobs? How can someone future proof themselves?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do you think a graduate degree in biostatistics is a good start for the apply of AI in health care?",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "1-No impact on any real economy. Not a single grain of rice, not one brick placed by these \"advances\"",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "2- language models are not \"intelligence\". No matter how large they are.",
        "compound": -0.361,
        "sentiment": "negative"
    },
    {
        "comment": "It is not AI that will cause the changes. It is the way people will use it. Human to human contact is one of the great drivers of constructive activity, when this decreases humanity will increasingly become separate from each other. I'm not sure of the consequences but I am sure it will not be be helpful.",
        "compound": 0.2549,
        "sentiment": "positive"
    },
    {
        "comment": "although i'm currently a cybersecurity student, i've noticed that field already utilizes AI for detecting and mitigating threats as two examples. i do wonder how much more things will augment as time goes on. c: this is probably an unpopular opinion; however, i find it rather oddly fascinating to live during this time, especially as a sci-fi lover. i compare the feeling to that of: \"pinch me, am i dreaming?\"",
        "compound": 0.7184,
        "sentiment": "positive"
    },
    {
        "comment": "6:43 Crazy how a press release surges intrest in a tool. Especially in this Copilot case.  It's such an undervalued tool right now and X is just going to take it to another level",
        "compound": -0.34,
        "sentiment": "negative"
    },
    {
        "comment": "Does the idea of training an AI using AI-generated data seem super sus to anyone else in that we're potentially building a garbage-in-garbage-out feedback loop?",
        "compound": 0.5994,
        "sentiment": "positive"
    },
    {
        "comment": "It's not necessarily bad right? I am wondering why you mentioned it's going to disrupt them specifically instead of just being integrated",
        "compound": 0.431,
        "sentiment": "positive"
    },
    {
        "comment": "you name a industry! ai will take it lol!",
        "compound": 0.5242,
        "sentiment": "positive"
    },
    {
        "comment": "AI in healthcare has lots of red tape from its being utilized.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Cybersecurity and Gaming are the fields I am most interested to see how AI will disrupt the field.",
        "compound": 0.4576,
        "sentiment": "positive"
    },
    {
        "comment": "Fun fact: Stoicism fans are creating a million videos of stoicism videos with AI tools each day.",
        "compound": 0.6705,
        "sentiment": "positive"
    },
    {
        "comment": "What is your advice for fresherjust starting in data science industry.....???? How do we move forward and get ahead in our career....???",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Your travel bag setup is on point, Ken! We're thrilled that your HP ZBook Studio G9 is helping you stay productive on the go. Safe travels and keep up the fantastic work! 👌🌍",
        "compound": 0.954,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken, have you deleted your discord server?? And what happened to 66daysofdata?",
        "compound": -0.5007,
        "sentiment": "negative"
    },
    {
        "comment": "50+ flights?? Nice man!!! Is it in your contract to travel that much?",
        "compound": 0.6388,
        "sentiment": "positive"
    },
    {
        "comment": "He be flexin those arms. Thats all. Its the world agenda. You just didnt know it",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "My team, some members of which are ex-HP employees, is currently contemplating acquiring a Z4 G8 workstation vs. just building our own liquid-cooled system in-house. With 2 A6000s, that is one hell of an expensive machine.",
        "compound": -0.6808,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Looking forward to those tutorials on that beast, though!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "brb time to get half these items. thanks ken. ✍",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "for the travel neck pillow - it seems the 'correct' way to use it is to have the open part behind your head... (Things I've learned from the internet).",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Love your work, and admire the community you have built around you. At 9:26 what is this keyboard?",
        "compound": 0.8074,
        "sentiment": "positive"
    },
    {
        "comment": "Enjoyable video.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "My bag has: my laptop, my lip balm and my loneliness",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "One thing I would add is an extension cord, so many times I've needed more then one power outlet...",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "A small nitpick -- Das Reich is not pronounced as reach, but as [ˈʁaɪç] (wikipedia has a good recording to check out).",
        "compound": 0.5877,
        "sentiment": "positive"
    },
    {
        "comment": "I love my trackball, use it both at home and on the go!",
        "compound": 0.6696,
        "sentiment": "positive"
    },
    {
        "comment": "I'm always gettign neck pains while working on my computer while traveling... I like this idea of a laptop stand to elevate",
        "compound": -0.0772,
        "sentiment": "negative"
    },
    {
        "comment": "Great timing for this, I'm heading to Google Cloud Next in SF with my work at the end of the month! Thanks Ken",
        "compound": 0.807,
        "sentiment": "positive"
    },
    {
        "comment": "Like.  that's insane -have a good day!))",
        "compound": 0.4574,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you ken ❤",
        "compound": 0.7717,
        "sentiment": "positive"
    },
    {
        "comment": "Nice! I personally had a similar bag but I now prefer cabin sized ones with wheels in them :3 I remember once being very tired and having to carry that .. But really cool! I am glad you are traveling more 🌻 You mentioned it as one of your goals for this year 🤗",
        "compound": 0.9292,
        "sentiment": "positive"
    },
    {
        "comment": "You're the coolest Ken. I hope I can be an amazing data scientist like you someday",
        "compound": 0.8481,
        "sentiment": "positive"
    },
    {
        "comment": "Ken traveling the world to provide us the best data science content in the world! ❤",
        "compound": 0.8655,
        "sentiment": "positive"
    },
    {
        "comment": "you are the best",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "experts \"go understand AI as much as you can, then incorporate that in to your career strategy. I cannot give you a specific title or job description.\"",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "most folks \"OK BUT WHAT JOB DO I DO\"",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "experts\".......... let me say this again, let me know where I lost you\"",
        "compound": -0.3182,
        "sentiment": "negative"
    },
    {
        "comment": "So whats the mystery between you and papaya?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey Ken, could you do a video about job market for data scientists. How the industry has grown and where we will be at in 5 years",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'm finding myself spending many of my work hours just trying to keep up with the amount of AI research and news being published daily. The speed of this revolution is making my head spin. I cannot even imagine where we'll be 10 years from now.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I want to hear the truth - what will happen to the data analyst jobs?",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "what about data analyst ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "You think that study statiscs,data and math can help became a professional punter?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "I have a confusion regarding AI prompt engineer demand because most of the companies actually banned the use of chatgpt due to a concern of data privacy. Can you please explain this a bit more because if most of the companies do not allow their employees to use chatgpt or AI tools like that, how AI prompt engineering would be in demand skill?",
        "compound": -0.4707,
        "sentiment": "negative"
    },
    {
        "comment": "I can picture a scene where someone will blame the AI clonation for some dumb things said in a meeting 😂.",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "Wouldn’t be surprised if jobs in the future don’t have Prompt Engineering experience as a prerequisite.",
        "compound": 0.2263,
        "sentiment": "positive"
    },
    {
        "comment": "How do we know if this video was created by the real Ken Jee or an AI KenJeeBot??",
        "compound": 0.3313,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you for sharing. What are the technical requirements/qualifications to be a prompt engineer?",
        "compound": 0.6486,
        "sentiment": "positive"
    },
    {
        "comment": "what about data scientist as a job?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "This is gonna be a revolution out there",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Its a tool used to automate repeated task still we need a human touch for the creative works.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "6s ago on notif. Hello, am 'new subscriber'. Save first, then listen to.",
        "compound": 0.4939,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for sharing this helpful content!",
        "compound": 0.8335,
        "sentiment": "positive"
    },
    {
        "comment": "What AI jobs are you  most interested in?  Also, thanks to Einblick for supporting the channel! Check out their awesome new notebook integrated prompt AI here: https://www.einblick.ai/?utm_source=yt&utm_medium=kenjee&utm_campaign=prompt",
        "compound": 0.9266,
        "sentiment": "positive"
    },
    {
        "comment": "What do you think? Is the code interpreter worth the hype or is it everything you dreamed of?  Let me know 👇",
        "compound": 0.3094,
        "sentiment": "positive"
    },
    {
        "comment": "U forgot to mention that ita just a couple of months old .. and its a beta version 😂..",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "On point with the solution, exactly the route I chose... thanks for the video.",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Ai really could replace data analysts, but the ai tools are becoming less effective because the job market is not prepare to a ai replace. So, we need advantage tine to prepare us. It's s my opinion.",
        "compound": 0.736,
        "sentiment": "positive"
    },
    {
        "comment": "People are wasting their time optimizing their prompts. Meanwhile you can code the same task with Pandas and re-use the script whenever you want with less text. I mean I learnt annotating text in my plots with Matplotlib once, now whenever I need to annotate I turn back to my old code and use it.",
        "compound": 0.1531,
        "sentiment": "positive"
    },
    {
        "comment": "CoDe InTeRpReTeR iS tAkiNg My JoB?!?! 😱",
        "compound": -0.7746,
        "sentiment": "negative"
    },
    {
        "comment": "Well said. I've been using ChatGPT as a coding assistant, originally motivated from a feeling of productivity-FOMO, and am now familiar with its limitations. The biggest one is in the workflow you mention, where you have to supervise the code. The productive boost is from \"writing every line\" to \"checking every line\", which is an improvement, but not a job-destroying-10X-er that headlines would have us believe.",
        "compound": 0.6858,
        "sentiment": "positive"
    },
    {
        "comment": "I couldn't agree more. The Code Interpreter is a valuable tool, but its level of maturity is not yet sufficient to replace any jobs entirely.",
        "compound": 0.1268,
        "sentiment": "positive"
    },
    {
        "comment": "ChatGPT is like spell check. Ever wonder why so many native English speakers can't spell or use correct grammar? ChatGPT has it's uses but most people will just be turned into even dumber useless eaters.",
        "compound": -0.7351,
        "sentiment": "negative"
    },
    {
        "comment": "Its interesting how anyone who finds the code interpreter to be \"the best thing ever\", has NEVER worked with data. People just don't seem to understand that the code interpreter, even if it worked flawlessly, is a very minor part of what Data Analysts do. No, it won't kill any new jobs, at least not the way it is now.",
        "compound": 0.9088,
        "sentiment": "positive"
    },
    {
        "comment": "Hello Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks for the video.",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I relate to the points you mentioned in the video.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I think that the code interpreter lacks something else as well that might be more important for an analyst. Tgat is memory. If you decide to resume your analysis later on in the the say, you practically need to restart your analysis if you didn't explicitly ask chatgpt to generate your files for download.",
        "compound": 0.4927,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "And even then, you need to re-explain it to chatgpt and give it the files again as it would have discarded the files/dataframes etc... that it created while doing the analysis.",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That was a big turn off for me when I tried the interpreter a few days ago. I was doing an analysis,  and decided to re-do it using to code interpreter to compare. I was impressed until I had this limitation!",
        "compound": 0.2244,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks again!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "Finally, a genuine video.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "It has only been out for less than a year though",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "So it's true... It's good extension for someone's learning... Apart from that one need to put good amount of efforts...",
        "compound": 0.835,
        "sentiment": "positive"
    },
    {
        "comment": "First viewer",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Check out the course bundle and FREE Github Repos here👇",
        "compound": 0.6166,
        "sentiment": "positive"
    },
    {
        "comment": "Course Bundle (Limited Time Discount 68% Off): https://bit.ly/3NAZ5oP",
        "compound": -0.2263,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ML Process Github (FREE): https://github.com/PlayingNumbers/ML_Process_Course",
        "compound": 0.6166,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ML Algorithms Github (FREE): https://github.com/PlayingNumbers/ML_Algorithms_Course",
        "compound": 0.6166,
        "sentiment": "positive"
    },
    {
        "comment": "stoked!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Congratulations, Ken. I'm looking forward to when there will be a discount on the course.",
        "compound": 0.5994,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken! Long time no speak, i just wanted to shoot you a message and see how you’ve been doing? I just connected with you on LinkedIn. I still follow and keep up with you channel, amazing work man! I wanted to also talk about a second podcast, my growth and knowledge in this field has grown and i have a lot to give your viewers, along motivation that you can go from knowing nothing to leading a team.",
        "compound": 0.6988,
        "sentiment": "positive"
    },
    {
        "comment": "Are these courses still on sale?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello, I'm very interested in purchasing the course, when I saw the video and I tried to get the money to purchase it ASAP, I was only able to get the 78$ today, but now it is only available at its original price, I know it is not really expensive to you guys, but I am from Colombia, so that price really is the monthly minimum wage, not something you can easily afford, do you see it possible to ever put the discount on again, still I think I am going to get it, it's just going to take me a couple months, I'm a college student, so it's not always easy to get the resources inmediatly, still, thank you for your amazing work and generosity, I've had in the back of my mind that I wanna be a data science for a while now, and one of the first videos that made things clearer for me, and encouraged me to start this journey was one of yours",
        "compound": 0.9686,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you! Your hard work and your presence on YouTube has been super motivating for me! I was able to demo my first project to my co-workers. I am so excited to see new things from you! Congrats!",
        "compound": 0.9508,
        "sentiment": "positive"
    },
    {
        "comment": "🌈 *PromoSM*",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Congrats Ken! No doubt these are courses packed full of value!",
        "compound": 0.8173,
        "sentiment": "positive"
    },
    {
        "comment": "There are so many free recources everywhere. No thanks",
        "compound": 0.2897,
        "sentiment": "positive"
    },
    {
        "comment": "New Nice Be-Ken-nnings!",
        "compound": 0.4753,
        "sentiment": "positive"
    },
    {
        "comment": "🥵 initiative!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Is the course in python??",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Say less. Take my money already, Kenneth.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey, congrats on the courses Ken. Thanks for creating them. :D",
        "compound": 0.9106,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Have you read Four Thousand Weeks, by Oliver Burkeman? I'm in the middle of the book now and it's honestly been a bit of a paradigm shift for me.",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Since you mentioned feeling guilty about not being able to do ALL the things while creating these courses, I figured I'd suggest yet another something for you to do. 😂",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "Hard work deserves a good payoff. Hope it does extremely well!",
        "compound": 0.7955,
        "sentiment": "positive"
    },
    {
        "comment": "congrats Ken on the launch of your course!!",
        "compound": 0.6103,
        "sentiment": "positive"
    },
    {
        "comment": "Course creation is no easy task, congrats to both of you Ken and Jeff on the launch of the ML courses!",
        "compound": 0.5245,
        "sentiment": "positive"
    },
    {
        "comment": "Congrats Ken!  I hope you do great with this course.",
        "compound": 0.8932,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Your students are lucky to have you!",
        "compound": 0.4753,
        "sentiment": "positive"
    },
    {
        "comment": "Duuude. Really proud of you man. Thank you.",
        "compound": 0.7089,
        "sentiment": "positive"
    },
    {
        "comment": "Sold on 3 major things:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "1. You made it clear that this is for people with some base of stats/cs",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "2. This is marketed as a reference manual for fundamentals and real-world application/implementation and not a crash course to becoming a DS",
        "compound": 0.3089,
        "sentiment": "positive"
    },
    {
        "comment": "3. 3 courses for $75 and lifetime access",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'm a data analyst that just started an MSDS and for those reasons, along with knowing your content/teaching style/doing your Kaggle walk-thoughs, I think it's safe to say that this deal is a no-brainer.  A reference manual on the ML process, the algorithms, and then the application in industry are great topics to cover.",
        "compound": 0.7906,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "FYI- I'm not gonna buy these courses to \"learn the skills to become a DS\" but simply as a supplement to enhance my learning/fundamental understanding of DS tools/ML.",
        "compound": 0.1941,
        "sentiment": "positive"
    },
    {
        "comment": "Honestly IDK what to do at this point.  I have a GitHub, I did the Google Data Analytics Cert and I've completed heaps of Coursera and LinedIn Learning content all of which resulted in ZERO recruiters reaching out and ZERO responses to resume submissions.  Oh and most jobs are \"entry-level\" with 3-5 yrs of experience.  Spending another $80 seems pointless.",
        "compound": 0.3954,
        "sentiment": "positive"
    },
    {
        "comment": "This is great timing! I just started my summer and was looking for a course to do.",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can we expect to see any future limited time sales or will this be the only one?",
        "compound": -0.2263,
        "sentiment": "negative"
    },
    {
        "comment": "Let's gooooo!! 🙌🏼 I know it's been a long time in the works and it's finally here!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Congratss to both you and Jeff 🎊",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Best news of the year!",
        "compound": 0.6696,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken! Are there projects that we need to do and get feedback?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Content is amazing!! Thanks Ken and Jeff!",
        "compound": 0.8213,
        "sentiment": "positive"
    },
    {
        "comment": "Congrats Ken 🎉🎉, this has been heavily needed",
        "compound": 0.8316,
        "sentiment": "positive"
    },
    {
        "comment": "The course looks good, sad I can't afford it right now. I'll make a plan to save to buy it later",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "First 🎉...",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Very interesting and inspiring👍",
        "compound": 0.7233,
        "sentiment": "positive"
    },
    {
        "comment": "I really like it. I mean customer service are very costly tbh, and a lot of customer's question can be answered by AI because the question more to be repetitive. It's exhausting to answer those kind of answers one by one every single day. AI can certainly help this task, and those CS can work on more analysing stuff",
        "compound": 0.3477,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I would like to ask for suggestions on how to secure data analyst interviews specifically for individuals with expertise in SQL, Power BI, and Tableau. Is it possible to land an interview if I only have knowledge of SQL?",
        "compound": 0.5994,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I'm seeking some suggestions. I tend to get demotivated whenever I struggle to comprehend certain concepts or fail to solve tasks while taking a course. Could you please provide me with some tips on how to stay committed to a course and see it through to the end?",
        "compound": 0.128,
        "sentiment": "positive"
    },
    {
        "comment": "Hi, ken.  Can you suggest way to land interviews with expertise in SQL, power bi, and Tableau? Is it possible to land an interview knowing only SQL?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "May I ask two questions:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "1.does data engineer need a good communication skill, and be good at math?",
        "compound": 0.7003,
        "sentiment": "positive"
    },
    {
        "comment": "2.can work freelancer as data engineer?",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Great timing. Just got a scholarship to study Data Science in my home country, Kenya and I am really glad I bumped into your channel ❤",
        "compound": 0.9117,
        "sentiment": "positive"
    },
    {
        "comment": "This is valuable for me and fellow friends who cant seem to escape cust service",
        "compound": 0.689,
        "sentiment": "positive"
    },
    {
        "comment": "My first jobs in tech were in the roles of support. It was highly stressful and thankless work. Recently, I joined a small core team to develop our in-house LLM to replace ChatGPT usage. One of my end goals is not to replace our tech support staff but to help them. As such, I am very interested in transfer learning and fine tuning transformers because I'll be doing exactly that very soon from now.",
        "compound": 0.8791,
        "sentiment": "positive"
    },
    {
        "comment": "Dude at 5:46 needs some sun",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Wow. 😯👏 Amazing coverage and hot topics to think about. Thanks so much for joining us at Zendesk Relate this year, Ken!",
        "compound": 0.8955,
        "sentiment": "positive"
    },
    {
        "comment": "Such a great time & learning experience!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "favorite people again! ❤❤",
        "compound": 0.9134,
        "sentiment": "positive"
    },
    {
        "comment": "Hi , good video",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I need some advice",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "perfect timing , thanks for sharing this",
        "compound": 0.8555,
        "sentiment": "positive"
    },
    {
        "comment": "It’s eye opening to see how companies are leveraging AI in their products and services. Great coverage of the Zendesk conference Ken!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome!!",
        "compound": 0.6892,
        "sentiment": "positive"
    },
    {
        "comment": "Great timing!Thanks..",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "Kaggle Notebook (Housing): https://www.kaggle.com/code/kenjee/housing-prices-example-with-video-walkthrough",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Check out the video description for additional resources!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "This has been very informative to see the process and how you included AI in it.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Half way through and just wanted to say this is very valuble content! Love the walkthrough type if content!",
        "compound": 0.7225,
        "sentiment": "positive"
    },
    {
        "comment": "You are amazing - this helped me so much - I am on the beginning of my journey and trying to find videos like this where people walk through what they've done. Yours is the best I've come across so far! TY!",
        "compound": 0.9018,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you Ken!!! I had no idea on how to do a kaggle challenge or what was expected, but you went through the whole process and explained what each part was!!! Now I have no excuses for a boring kaggle profile",
        "compound": -0.7662,
        "sentiment": "negative"
    },
    {
        "comment": "Hi Ken! thanks for making this great tutorial. Can you do tutorial on fine tuning the NLP pretrained model? there are few videos out there but I think you are more advanced on communicating the technical things so it's make us easier to understand. Thanks!",
        "compound": 0.9465,
        "sentiment": "positive"
    },
    {
        "comment": "Being on a hill also means less risk of water damage given any runoff will flow downhill.  I'm assuming a depression is opposite and runoff will flow and pool towards the hoke",
        "compound": -0.8275,
        "sentiment": "negative"
    },
    {
        "comment": "Hey Ken, have you tried using ChatGPT with Noteable plugin to help you solve a Kaggle competition? I used it and it works (https://www.youtube.com/watch?v=iIKfJT5QF_I), I think people will enjoy if you made a video using that",
        "compound": 0.7941,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks Ken for the tutorials. I'm not really a fan of your videos because they're not technical enough but I really enjoyed this and learnt a couple of things. Wish you could make more of these",
        "compound": 0.8691,
        "sentiment": "positive"
    },
    {
        "comment": "I am a material scientists who works with large data sets and I want to pivot into data science because I've grown to love how data is manipulated and analyzed outside of just scientific applications.  academia has been exhausting and I want to refresh things in a new field.  Do you by chance do any personal life coaching??  regardless, thank you for your videos, they are both motivational and instructional!!",
        "compound": 0.7306,
        "sentiment": "positive"
    },
    {
        "comment": "Really AMAZING video! Helps me on my grad journey breaking into data jobs",
        "compound": 0.8394,
        "sentiment": "positive"
    },
    {
        "comment": "Amazing Work Ken. Thank you for explaining so thoroughly :)",
        "compound": 0.8712,
        "sentiment": "positive"
    },
    {
        "comment": "This project is amazing! Can you make more videos like that please?",
        "compound": 0.847,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the video, Ken. But with all due respect, it's less of a data science tutorial and more of a ChatGPT demo.",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "Hey sir, I would wanna know about this, would you recommend using powerbi for EDA process before model building than pandas?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Where have you used chatgpt?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Wonderful content as always.",
        "compound": 0.5719,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "But you could literally reset the default theme to 'plotly_dark'. This would have been better than repeating most of the layout update.",
        "compound": 0.5927,
        "sentiment": "positive"
    },
    {
        "comment": "I think to make the code less confusing, the y_test could be replaced by y_valid like some notebooks did so the test suffix is reserved for the real test data.",
        "compound": 0.2247,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for your wonderful videos and your codes are always so clean and easy to follow! Cheers!",
        "compound": 0.948,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! Have you had to utilize PCA before?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "As a practicing data scientist, how important would you say it is to handle calculations such as integrals by hand? I studied this stuff 10 years ago and have since had my skills atrophy. Though the intuition is still there. Is it worth going through that stuff again or just diving into the deep end?",
        "compound": 0.7622,
        "sentiment": "positive"
    },
    {
        "comment": "My nga, ure the best!!!",
        "compound": 0.7249,
        "sentiment": "positive"
    },
    {
        "comment": "Can you make a whole playlist where you go through different projects because you have a very unique way of teaching and I think a lot of people would benefit from that",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "can you make a playlist for upcoming projects",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Sometimes I think i picked the worst year to get into DS , I do love the field, really do, but when the market requires PHD for entry levels.. you know you got yourself into big trouble",
        "compound": -0.5423,
        "sentiment": "negative"
    },
    {
        "comment": "Thank you for explaining this so well! As a beginner this gave me invaluable insight on how to approach a problem on Kaggle.",
        "compound": 0.4278,
        "sentiment": "positive"
    },
    {
        "comment": "Immedietly i saw this video i also started creating the same project 🤣 thanks !!!!",
        "compound": 0.858,
        "sentiment": "positive"
    },
    {
        "comment": "Data science is dead lol",
        "compound": -0.3612,
        "sentiment": "negative"
    },
    {
        "comment": "Great Timing!!Thanks.. following  to u with closely",
        "compound": 0.6892,
        "sentiment": "positive"
    },
    {
        "comment": "This video is basically useless. Tell me one point that you actually suggested something other than ask CHATGPT.",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "7:02 What is the name of this platform (website)?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "These AI tools are some of the best teaching resources ever created. It makes you wonder in the probably not-so-distant future whether it could just outright replace the knowledge jobs that we humans do.",
        "compound": 0.7351,
        "sentiment": "positive"
    },
    {
        "comment": "great stuff Ken",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "BARd and chatGPT are too stupid or ugly at creating some codes in Swift, while they are good at Python.",
        "compound": -0.2023,
        "sentiment": "negative"
    },
    {
        "comment": "Exactly 💯 I use ai to do my data visualizations. I only know matplotlib but I leverage ai to change the code using a matplotlib library to plotly!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Data Science hiring has slowed down. The demand is pretty low. It's not because of layoffs, many people might argue on this. The demand for data engineers is good but it's not same with  data science. What are your thoughts on this, the hiring slowdown for data science only @Ken Jee?",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken! So I am about to complete my undergraduate in computer science, I have adequate knowledge in python and it's libraries and also a good idea on MySQL. I have decided to pick up a specialization for my masters. I'm confused on which one to take. The idea of analyzing and predicting data really intrigues me but however I'm not that great at math overall. But I can do well in statistics though. Do you think it's worth picking up Data Science or should I lean more into Artificial Intelligence as a whole?",
        "compound": 0.7746,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Also, I really love your videos and how you keep updating roadmaps constantly as times keep changing. Really appreciate your efforts!",
        "compound": 0.8307,
        "sentiment": "positive"
    },
    {
        "comment": "For the features you talk about in chat gpt, are some of those part of the paid version of it? Thanks (I am someone who uses the free thing or version of it).",
        "compound": 0.7351,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken, just to let you know I'm a beginner in this field and just like a kid I was looking for how to start on type videos. Fortunately I found you and you made total sense to me regarding everything. Looking forward to follow you more on this journey and also by reading comments of other people I can deduce you are a good guide and very soon I'll find it out too ;)",
        "compound": 0.743,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for your insights, Ken. Fascinating to see how ChatGPT will influence the fields of Data Science and Bioinformatics. The tool saves a lot of time when coding or summarising text. You also need good domain knowledge to identify when the model hallucinates. ChatGPT often invents functions; you need domain knowledge to sort the good from the bad. I wonder how these models will evolve when more and more online content is generated by them.",
        "compound": 0.8271,
        "sentiment": "positive"
    },
    {
        "comment": "Try writing drag and drop case. It suck at it now.",
        "compound": -0.7096,
        "sentiment": "negative"
    },
    {
        "comment": "Awesome video Ken! I was surprised that data sets can be fed to chat GBT as I thought it only takes text as an input. How can I do this??",
        "compound": 0.7685,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! Will you suggest me to transition my career into Data analytics/science despite the impact of AI. Will it be safe job for 10 to 15 years down the line???",
        "compound": 0.5764,
        "sentiment": "positive"
    },
    {
        "comment": "Please answer....?????????❤",
        "compound": 0.8156,
        "sentiment": "positive"
    },
    {
        "comment": "Yamede khudasai",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "You recommend 3.5 or upgrade to the GPT-4 via GPT plus or alternate access?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Love the video! As a beginner, what would be the best way for me to feed ChatGPT the initial data? Where could I get some mock data from?",
        "compound": 0.8048,
        "sentiment": "positive"
    },
    {
        "comment": "A jits dummy! 😂😂😂😂",
        "compound": 0.8977,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, awesome video as always! I'm finishing my PhD in Physics next month and planning to leave academia to go into data science. I've found your videos on these topics incredibly insightful. I've been using ChatGPT to start doing some fun side data science projects and learn more about Machine Learning (took a course in it like ~4 years ago, so very rusty on the topics), and it has been incredibly helpful as a knowledgeable assistant. For someone with coding experience in Python but maybe not expert developer level, ChatGPT is so good at getting one started at learning how to use new packages and tools that are outside of one's current knowledge base. I know several friends who are also planning on leaving academia and trying to break into data analysis/data scientist roles, so I will be recommending them to your channel!",
        "compound": 0.9534,
        "sentiment": "positive"
    },
    {
        "comment": "What certificate is good for eastern Europe beginners in Data Analytics?",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Great video! Is creating code a premium feature? I have the free subscription and chatgpt told me it couldn't create code",
        "compound": 0.8433,
        "sentiment": "positive"
    },
    {
        "comment": "Someone with no DS/ML knowledge wouldn't know if ChatGPT makes a mistake and how to fix it. A data scientist would.",
        "compound": -0.5574,
        "sentiment": "negative"
    },
    {
        "comment": "​ Thank you Ken for this video. I signed onto your course on Udemy about \"How to Start a Career in Data Science 2023\". Great content.",
        "compound": 0.765,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "You and @DataNash are definitely my guide because I'm new to this from a very different field and it feels overwhelming what I have to learn to be able to even get an interview in the UK.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Leveraging Ai is good, but.. Ai Jobloss is coming fast. Can we please Cease Ai / GPT? Or start by Pausing Ai before it’s too late?",
        "compound": 0.644,
        "sentiment": "positive"
    },
    {
        "comment": "Im new and doing all of what u said wow! Looks like im going to make it 😆",
        "compound": 0.8439,
        "sentiment": "positive"
    },
    {
        "comment": "On point! I was totally surprised with people's reaction that this AI explosion would make data science *less* relevant, due to automation. At this time, massive amounts of money are getting poured into machine learning. So my reaction was the opposite. And since using ChatGPT and having some familiar with their scaling laws, I don't see DS getting abstracted away. You said it better than I could 👌",
        "compound": 0.889,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you so much for the video . I had the same questions and your answer was really good.",
        "compound": 0.6901,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you so much for this",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Elite editing on this and honestly I think data scientists are well positioned for the new ai world",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Really well edited, scripted, and important video for today",
        "compound": 0.4927,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken. You're one of my biggest inspirations by far. No really, you got me to read David Goggins' book, same with Dr Sinclair and others (keep those recommendations coming).",
        "compound": 0.2263,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I have a request, I totally like this series of \"If I could start over\" but could you add like... some more philosophical emphasis on why ?",
        "compound": 0.6306,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Just imagine for a second a total loser who cannot take anything much less himself seriously for a long enough time frame.",
        "compound": -0.6267,
        "sentiment": "negative"
    },
    {
        "comment": "How would that person go about taking proper accountability for their learning especially in these turbulent times ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Like.... this hypothetical loser (totally not me, I win so much) can't take college too seriously but wants to learn anyways, they need a direction and purpose.",
        "compound": -0.4284,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "How might you transform that person  ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "My questions :",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What are concepts and hard lessons you WISHED you could have learned earlier ?",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "What are your proven methods of success ?",
        "compound": 0.5719,
        "sentiment": "positive"
    },
    {
        "comment": "What would be your guide/map that you could hand to a younger self  to escape the so called \"matrix\".",
        "compound": 0.5994,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "From finances, emotional management, opportunity cost. EVERYTHING !",
        "compound": 0.5707,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "\"The portal is closing, we don't have much time kid. QUICK ! Take this, and stay the course\" type of information ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for taking your time.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I appreciate all the hardwork.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "This was very helpful! I re-started my data analyst learning recently and feel a bit lost of where begin again. Currently studying python and sql. I'll be sure to check your other vids out as well. Thanks again",
        "compound": 0.8118,
        "sentiment": "positive"
    },
    {
        "comment": "I just finished my google data analytics professional certification. As someone who only has knowledge in data through excel, chatgpt was very helpful in my studies. I find SQL and R were the most challenging parts of the course, but chatgpt was able to make it easier for me to digest by asking it how the functions and syntax relates to excel and break the topics down into a lot more digestable chunks. I'm currently using GPT4 to expound my ideas into feasible projects to add to my portfolio.",
        "compound": 0.9041,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I would also like to add that you have no idea how your videos were super helpful in my data learning journey. Thank you so much Ken!",
        "compound": 0.8687,
        "sentiment": "positive"
    },
    {
        "comment": "Your gains bro. You looking crazzzy. Good job. Great video as well.",
        "compound": 0.8885,
        "sentiment": "positive"
    },
    {
        "comment": "I love your approach, but I still feel like beginners should be cautious, AI tools are still not the most reliable, and like you said, they tend to hallucinate. Love the video though!",
        "compound": 0.9431,
        "sentiment": "positive"
    },
    {
        "comment": "Your perspective and approach is very good as always. Thank you.",
        "compound": 0.6901,
        "sentiment": "positive"
    },
    {
        "comment": "Very informative",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "My kid is going to choose Data science &AI at college but I'm afraid there aren't going to be enough jobs for juniors by the time my kid graduates.What do you think of it? Could you share your opinion on this?",
        "compound": 0.4871,
        "sentiment": "positive"
    },
    {
        "comment": "hello sir",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am going to apply for junior data scientist position.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "so by reading the description can you suggest me what sorts of project should I need to do.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi, ken.  Can you suggest me how to land intedview with expertise in sql, powerbi, tableau. Is it possible to land interview knowing only sql?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Maybe I'm not your audience but found the intro so tedious that I moved on.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken.  Thanks for this great video.  I am planning to study computer science.  But since the launch of chatgpt and all the other AI tools, I've only heard of programmers being replaced.  Should I change my mind about computer science or just ignore all this talk?",
        "compound": 0.0644,
        "sentiment": "positive"
    },
    {
        "comment": "I, for one, welcome our AI overlords.",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "AI cant replace papaya farmers. Checkmate AI! lol",
        "compound": 0.4753,
        "sentiment": "positive"
    },
    {
        "comment": "I still think it's overrated. Not sure but my experience writing with AI has been the same. Sure it helps and increases your efficiency in lots of use cases but when building end to end projects relying on AI especially in software dev is just not going to work.",
        "compound": 0.845,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I used to spend 2 hours on debugging but when AI loses it I spend more than a day debugging where it messed up",
        "compound": -0.7227,
        "sentiment": "negative"
    },
    {
        "comment": "Honestly I got demotivated learning Data Science because of AI that I stopped for 2 months but your video gave me hope on how I can actually speed up my learning and do more using these tools. Thanks a lot man 👏🏾❤",
        "compound": 0.9437,
        "sentiment": "positive"
    },
    {
        "comment": "I tried chat gpt this week, it helped me come up with a machine learning algorithm that I was too afraid to dive into. I could have done it without chatgpt but it’s extremely faster than googling. It got stuck once or twice but rewording my question usually worked for it.",
        "compound": -0.3612,
        "sentiment": "negative"
    },
    {
        "comment": "Ken! You should do a podcast with some of your friends about this topic -- maybe Tina since she also released a video with similar vibes. Would love a long form discussion about this pivotal moment.",
        "compound": 0.8221,
        "sentiment": "positive"
    },
    {
        "comment": "How do we know that \"The Real Ken Jee\", hasn't already been replaced with \"AI Ken Jee\"!?!?! 😳",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The new fire🔥",
        "compound": -0.5859,
        "sentiment": "negative"
    },
    {
        "comment": "You really consolidated my thoughts on AI into a succinct video. Now the question is, did you write the script or did ChatGPT?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can you combine smart glasses with AI?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Starting my master's degree in computer science with data analytics in September.... a little nervous I'll be obsolete by the time I graduate! Won't give up, but it is unnerving all the same. And I'll incorporate AI where I can to be effective.",
        "compound": 0.5328,
        "sentiment": "positive"
    },
    {
        "comment": "My opinion for people is if you have the choice, plan for a job that uses AI as a tool rather than something that it can automate, atleast for now. This is a new technological era that we don't have answers to just critical rational thought with some logical implication and illogical creativeness to prepare for all scenarios. Better or for worse, no one really knows the best plan, I personally say join them and make friends with them in a sense",
        "compound": 0.8344,
        "sentiment": "positive"
    },
    {
        "comment": "What a great video. U touch on all the relevant points. Defenetiley needs sharing",
        "compound": 0.7845,
        "sentiment": "positive"
    },
    {
        "comment": "I would be really grateful if someone can tell me an I wasting 40 hours per week by learning Python, Linux and Networking, due to rise of AI. Thanks!",
        "compound": 0.5838,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for watching everyone! I promise this is me and not Chat GPT (contrary to what the end of the video may suggest)",
        "compound": 0.6696,
        "sentiment": "positive"
    },
    {
        "comment": "how does it handle angular?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "It isn't that great. It even struggles every now and then with a baby language like AutoHotkey and even struggles to differentiate v1.1 and v2 and sometimes makes things up that aren't true still. It can write prototype code and you adjust it from there. That's pretty much it.",
        "compound": -0.6028,
        "sentiment": "negative"
    },
    {
        "comment": "dude that ending...... hahaha",
        "compound": 0.5574,
        "sentiment": "positive"
    },
    {
        "comment": "I am also using GPT 4 for coding a while i can say its 70% accurate than previous iterations but it also makes mistakes sometimes it forgets methods which are necessary and don’t know the flow of code.",
        "compound": -0.5023,
        "sentiment": "negative"
    },
    {
        "comment": "Looks like a lot less need for software engineers then",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Before it was very hard to find the specific solution to my problem but now, I just had to ask chatGPT then validate if the response is right or wrong",
        "compound": -0.3499,
        "sentiment": "negative"
    },
    {
        "comment": "I see ChatGPT 4 for software development as both a learning and productivity tool.  I can easily see a future interview where I have to demonstrate conversational programming utilizing ChatGPT 4 and then explaining the code it has written.  I don't think it will replace programmers, but will result in programmers with more productivity.",
        "compound": 0.1779,
        "sentiment": "positive"
    },
    {
        "comment": "Not lying about that soon u won't be coding at all 😂😂😂",
        "compound": 0.8879,
        "sentiment": "positive"
    },
    {
        "comment": "Same with writing. I hope craft of writing will no longer be deemed the end goal. Like how calculators have replaced silly algorithms for basic maths.",
        "compound": 0.5106,
        "sentiment": "positive"
    },
    {
        "comment": "ShatGPT is only as smart as the data it is trained on, making its use cases very limited.  If you trained it on the collective knowledge of 6 year old children, the software is incapable of giving you a 12 year old's answer.",
        "compound": 0.079,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The more you learn about AI, the more you realize how absurdly stupid the whole approach to AI is.",
        "compound": -0.5267,
        "sentiment": "negative"
    },
    {
        "comment": "Ending was a good touch haha",
        "compound": 0.7096,
        "sentiment": "positive"
    },
    {
        "comment": "Been hearing that a lot of the junior positions for Data Analysis are gonna be dead thanks to IA, what do you think?",
        "compound": -0.34,
        "sentiment": "negative"
    },
    {
        "comment": "Clearly Ken just wanted to flex his biceps",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "We think a lot faster than anything we do, not just coding. Conversational coding, in your terms, works so well in my humble estimation because once that thing starts spitting out the code to what you want to accomplish, you can get right back to work ideating. When I used to code without chatGPT, my mind would be flooding with ideas and the mechanical distraction of trying to type with minimal errors and get the code down BEFORE I forget the next thing I want to work on that keeps intrusively disrupting. Now, I type my request, it does its thing, and I'm way more likely to keep the train of concepts flowing. Sometimes I'll furiously scribble some indecipherable reminder while it's outputting, so I can return to that line of thought after I double check its work.",
        "compound": -0.3937,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "This thing is beyond a game changer.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I feel like I got promoted from code monkey to project manager on all my personal projects. If they're really worth anything, we're about to find out because my job is ideation, direction, and integration and chat gpt is my programming team. I'd call it Prompt Coding. The better your prompts, the better the code",
        "compound": 0.9061,
        "sentiment": "positive"
    },
    {
        "comment": "With IA's getting improved, would it be wise to start to learn data science and spend more than 1 year learning about it ?",
        "compound": 0.7351,
        "sentiment": "positive"
    },
    {
        "comment": "I think what a lot of people failed to understand, is that AI is a function and humans are the input. Without proper input (or prompts), there's no way AI can function therefore everything you're learning at present is still very valuable and important because your input helps to verify, identify & validate the expertise of the subject. Please don't be that person who takes AI prompts as replacement for everything because it just proves you're not an expert of the field! Why are you somehow speaking on behalf of lawyers as a content writer ?????",
        "compound": 0.8229,
        "sentiment": "positive"
    },
    {
        "comment": "Dear GPT-4, please write the transcript for the video \"I'll Never Code the Same Again... (GPT-4 is OP)\". Thanks, Ken.",
        "compound": 0.7783,
        "sentiment": "positive"
    },
    {
        "comment": "😄",
        "compound": 0.6705,
        "sentiment": "positive"
    },
    {
        "comment": "We also need to worry about using ChatGPT to potentially code ourselves out of a job. Tina just released a video about this herself, and she's freaking out.",
        "compound": -0.6908,
        "sentiment": "negative"
    },
    {
        "comment": "Dude is swole 😍",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "What a twist 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Do you think OpenAI would take any responsibility of it's ai product if it leads your apps to something wrong?  Are you the only ONE to face any legal or other consequences. Even Images it provides is based on some existing images. They might have copyrighted.",
        "compound": -0.3818,
        "sentiment": "negative"
    },
    {
        "comment": "I would like to know your thoughts on how GPT-4 would affect the data analytics world in terms of employment. I'm almost done with the Google data analytics certificate and its pretty nerve-wracking. Although AI cannot fully replace the job, it might lower, if not, eliminate the demand for junior analysts. I am planning to take AI courses in Coursera though to hedge my skillset in this hyped up AI period. Great video as always!",
        "compound": 0.8505,
        "sentiment": "positive"
    },
    {
        "comment": "Genuinly scary end 😂",
        "compound": -0.0772,
        "sentiment": "negative"
    },
    {
        "comment": "I agree with \"loosing human touch, but not really loosing creativity, coz AI helped us to type what is in our mind, and that is creativity of human mind, so don't ask how to build something, but ask about some problem when we build something..maybe this is just my thoughts",
        "compound": -0.358,
        "sentiment": "negative"
    },
    {
        "comment": "I have talked about GPT-4 vs GPT-3 on my own channel as well. The difference is HUGE! GPT-4 is a different beast, at least for me a programmer. But in comparison to the release of ChatGPT, there is almost no hype around it.",
        "compound": 0.1275,
        "sentiment": "positive"
    },
    {
        "comment": "Would you mind sharing how you did the animation with ChatGPT? Would really appreciate that 🙂",
        "compound": 0.8176,
        "sentiment": "positive"
    },
    {
        "comment": "holy shit the ending ☠☠",
        "compound": -0.5574,
        "sentiment": "negative"
    },
    {
        "comment": "Ahahaha the ending killed me! Nice touch ❤ Your creativity hasn't died with the automation 🌻 My coding style also changed completely especially for specific usecases!",
        "compound": 0.8228,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "However, one concern I have is the ability to develop professionally and understand the code you're using. I am currently using Django and I just pasted a normal plotly chart to ChatGPT and asked it to convert it to plotly.js to be rendered. It works but if I didn't spend time trying to learn what it did I would've had a fully functional interactive chart with no idea about the syntax.",
        "compound": -0.2846,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Of course I know enough to be able to copy paste, but do you think this is something to be worried about and we each have to understand what it writes 🤔?",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks man! Can't wait to meet someday :)",
        "compound": 0.7345,
        "sentiment": "positive"
    },
    {
        "comment": "‘Conversational coding’ is very good label. I’ve been experimenting and using it similarly for method blocks. This whole thing feels like another abstraction upwards for a greater productivity",
        "compound": 0.7425,
        "sentiment": "positive"
    },
    {
        "comment": "Great ending haha 👏",
        "compound": 0.7964,
        "sentiment": "positive"
    },
    {
        "comment": "Shoot, I've been using it to just learn python.",
        "compound": -0.34,
        "sentiment": "negative"
    },
    {
        "comment": "Well, I hope that John Connor will be prepared for the KENMINATOR haha. Jokes aside, the chatGPT had improved a lot my productivity, I can do more in less time. It's a great tool.",
        "compound": 0.9524,
        "sentiment": "positive"
    },
    {
        "comment": "1:34 see Ken's chat history 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "One of the things I've loved with chatGPT is that it understands the \"why\" so if you're trying to solve a problem, and it's giving you code you don't understand why it's there, you can ask why it is, and it will give a detailed breakdown to explain it to you so you aren't just flying blind.",
        "compound": 0.7689,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That's just as helpful, to me at least, as any of the code it produces.",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "Any ideas what this means for the data science / AI job market?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I started a masters in data science in February, coming from Finance. I love this stuff, so I’ll just go through with it regardless, but it now seems to me that there will be 0 need for junior data scientists when I finish my masters next February",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you!",
        "compound": 0.4199,
        "sentiment": "positive"
    },
    {
        "comment": "Great info. People should narrow their job search to 2-3 industry's and then have several projects for each industry. Or have some amazing projects that cross over realistically.",
        "compound": 0.836,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "If interested in real estate and want to work for a company life Redfin/Zillow, have projects that look at real estate.",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "Great advice!!  So let's say that I want to end up with a data science position related to the music industry or to soccer in some way.  Do you have any suggestions on how to tailor learning in that way??  Just look for relevant data and try to build a presentation??  Reach out to someone in one of those industries??  Thanks as always!!",
        "compound": 0.8892,
        "sentiment": "positive"
    },
    {
        "comment": "How do you not get overwhelmed by choice when designing your portfolio? There are so many articles on what it could look like and which projects to feature",
        "compound": 0.3296,
        "sentiment": "positive"
    },
    {
        "comment": "Which networking platforms do you find most useful In this regard except LinkedIn?",
        "compound": 0.4927,
        "sentiment": "positive"
    },
    {
        "comment": "So saying a fun fact about me doesn't work?",
        "compound": 0.552,
        "sentiment": "positive"
    },
    {
        "comment": "The problem is that everyone asks for experience, even for junior positions",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "i am thinking about studying data science is it possible to work as a data analyst and data engineer with a data science degree",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "as much as data science interests the hell out of me i know data engineering is more in demand so i’ve been studying that. it’s been fun so far.",
        "compound": -0.2682,
        "sentiment": "negative"
    },
    {
        "comment": "What be your approach to get into data science after some career gap. Yes I'm studying data science. Building up my resume right now with some projects. But still worried if I can land a job or not.",
        "compound": -0.2382,
        "sentiment": "negative"
    },
    {
        "comment": "I would love to know the differences between all three",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "I just completed my data analyst course , Am I able to shift from data analyst to data engineer role in future after working 1-2 year as a analyst",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do you think is possible to get a data engineer job in an entry-level position 🤔?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What about Machine Learning Engineers?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Nice try",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "Naaah they read my mind 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Me and my friend where randomly talking about a specific recipe...that second, the same recipe (as a video) came up on my phone ads.",
        "compound": 0.4939,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "They're listening to us",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "This doesn’t not answer the question you yourself asked and made a video about",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Maybe they are really listening.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Important question how does the phone know who's my friend 😨 also what if i never had a friend 😨😮",
        "compound": -0.6159,
        "sentiment": "negative"
    },
    {
        "comment": "Never split the difference",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "So good they can’t ignore you",
        "compound": 0.1761,
        "sentiment": "positive"
    },
    {
        "comment": "Crucial conversations",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "4 disciplines of execution",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The one thing",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "A few weeks ago I had a conversation with a work colleague on Teams and mentioned the book 'Worker Leadership' and said that it was largely a case study of implementing a program at John Deere Harvester. Then I started getting ads for John Deere Harvester on my phone (a different device). I am a librarian and live in the suburbs. No activity I've performed on my phone would suggest such an ad. My conclusion is that my phone is listening to me.",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Then how the social ads are always on point without even me searching for that thing!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I do believe they listen, I always get recommendations when I speak on certain thing.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "If you're not the consumer, you're the product.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Lol. My phone goes “uh-huh” every other day",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "I was thinking myself to pursue data science for a few years before moving to project management so this is quite eye opening.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do you believe there is as much room to grow in an on hands role as there is in a management role ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Have you been using chatGPT for your work? Let me know how below!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can you make update in road map to reach the job opportunity more faster after chat gbt and other machine learning tools that will affect in data science role .and thanks for your efforts to make this video ❤",
        "compound": 0.875,
        "sentiment": "positive"
    },
    {
        "comment": "Why not develop your own chatbot using data that you trust instead of using someones blackbox?",
        "compound": 0.5106,
        "sentiment": "positive"
    },
    {
        "comment": "Great vídeo! It just goes to show that we can be friends with ChatGPT as data scientists.",
        "compound": 0.8172,
        "sentiment": "positive"
    },
    {
        "comment": "Hi, ken.  Can you suggest to me how to land interviews with expertise in SQL, power bi, and tableau? Is it possible to land an interview knowing only SQL?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi, ken.  Can you suggest me how to land intedview with expertise in sql, powerbi, tableau. Is it possible to land interview knowing only sql?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi, ken.  Can you suggest me how to land intedview with expertise in sql, powerbi, tableau. Is it possible to land interview knowing only sql?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "i like how honest u are about this wish more people were this way",
        "compound": 0.837,
        "sentiment": "positive"
    },
    {
        "comment": "Hi.. i need your help in my profession. I am in taxation department and have to analyse 100's of spread sheet generated by different platforms.. please guide which language or set of skills i should learn to improve my performance and work efficiently. Please guide looking forward for your response",
        "compound": 0.8979,
        "sentiment": "positive"
    },
    {
        "comment": "Data science ppl r in trouble",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "I'm hoping between this video and Tim Ferris' \"The 4 Hour Work Week\" my retirement is right around the corner.",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken Jee. I am currently doing Masters in Data Science, still in my 1st year. Could you recommend types of projects I could work on to add to my portfolio? What do you think could make me stand out?",
        "compound": 0.4329,
        "sentiment": "positive"
    },
    {
        "comment": "Based upon your use cases, it should more likely be saving 4-5 hours each day.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Guys I have met Ken Jee in person and this guy is 100% not him. I'm convinced ChatGPT generated this video to make it seem like he's still in control of this YouTube channel...",
        "compound": 0.0624,
        "sentiment": "positive"
    },
    {
        "comment": "Great video! ChatGPT is also super useful for writing unit tests",
        "compound": 0.9041,
        "sentiment": "positive"
    },
    {
        "comment": "If you all have not read the article: *Coding won't Exist in 5 Years*",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Go and read it. Thank me later :)",
        "compound": 0.6705,
        "sentiment": "positive"
    },
    {
        "comment": "Nice video! It made my work life easy as well",
        "compound": 0.7959,
        "sentiment": "positive"
    },
    {
        "comment": "Ooh interesting usecase for refactoring! I have been mainly using it for text generation and debugging/help in Python/Django",
        "compound": 0.4574,
        "sentiment": "positive"
    },
    {
        "comment": "A game changer tbh",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Another great use is for when you get an error",
        "compound": 0.34,
        "sentiment": "positive"
    },
    {
        "comment": "I remember my grandpa saying he thought he would never sell out, but he eventually started to use the power tools 😅",
        "compound": 0.5023,
        "sentiment": "positive"
    },
    {
        "comment": "Great video! As a university student still learning Data Science, I definitely see the benefits you provided in the video. However, I'm worried that with more people using chatGPT, this will increase competition in the job market since more people will have developed and polished code and projects.",
        "compound": 0.8687,
        "sentiment": "positive"
    },
    {
        "comment": "Everyone following on LinkedIn knew this video was inevitable ever since that post on ChatGPT a couple of weeks ago 😂",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "I like your Chat GPT buddy😂",
        "compound": 0.6597,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I finally tried it only yesterday(I know, I am słów) and I felt huge amount of gratitude for making my studying a loot easier so",
        "compound": 0.8126,
        "sentiment": "positive"
    },
    {
        "comment": "I could almost give Chat GPT a  gratitude hug😊",
        "compound": 0.9081,
        "sentiment": "positive"
    },
    {
        "comment": "I had been waiting for you to do a video on chatGPT. This was actually extremely well thought out and non biased. Excellent video!",
        "compound": 0.6468,
        "sentiment": "positive"
    },
    {
        "comment": "ChatGPT help me learning MLOps and complex concepts in deep leearning; now i'm focus on IA research so... a great advance",
        "compound": 0.7783,
        "sentiment": "positive"
    }
]