[
    {
        "comment": "I am happy to hold you guys accountable on your projects! Leave some of your ideas in the section below to make sure that you will do them. Also, make sure to subscribe and turn on notifications to be alerted when part 2 comes out on Monday!",
        "compound": 0.8264,
        "sentiment": "positive"
    },
    {
        "comment": "Can I put this project in my resume for internship ??",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "thank you thank you thank you! a thousand times thank you!!!!!!",
        "compound": 0.8798,
        "sentiment": "positive"
    },
    {
        "comment": "Hi , can you please let me know where can I get a live dataset for market mixing model project",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "https://codeverse001.blogspot.com/2023/08/data-science-in-sports-analytics.html",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey, this is Amazing. Just wanted to know, I am an absolute beginner in Data science. So should I be doing this? Will I be able to understand data science after this or should I complete some prerequisites before starting this project?",
        "compound": 0.6322,
        "sentiment": "positive"
    },
    {
        "comment": "Stumbled upon this video as I'm in in the middle of coop search term. Will it help in any way if I included whatever I did in this series in my resume ?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you for the feedback Ken sir !!!",
        "compound": 0.5229,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome video but i have questions what are the key skills that an undergraduate student must have to secure or placed in data analytics and what about career improvement? Please sir answer the question i m lot of confused there.",
        "compound": 0.8641,
        "sentiment": "positive"
    },
    {
        "comment": "From where we can collect data apart from Kaggle?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "one of the things in the video is the background music. somehow that keeps us glued in the video and also you content is amazing sir. Thank you for this.",
        "compound": 0.743,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you, even just this intro made me much more confident about my current university assignment.",
        "compound": 0.7178,
        "sentiment": "positive"
    },
    {
        "comment": "What are the prerequisites(skills)for this projects? What should I learn before this project.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks a lot for uploading detailed and crisp DS project. This is really helpful !!",
        "compound": 0.7634,
        "sentiment": "positive"
    },
    {
        "comment": "Sir please help how we train model and do some prediction in data cleaning project.",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "hey ken , thank you so much for this appealing effort that you are doing",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Oh my god this is exactly what i want thank you thank you thank you.God bless you and guide you to the right way",
        "compound": 0.8934,
        "sentiment": "positive"
    },
    {
        "comment": "Would love a sports DS project from scratch",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Very underrated channel! I believe i just found a diamond in a haystack!",
        "compound": 0.4559,
        "sentiment": "positive"
    },
    {
        "comment": "RObust talking bro",
        "compound": 0.34,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken ! Thank you for creating an amazing platform for us to not get overwhelmed with data science. This is my start of data science journey. I am so glad to be here. More power to you :)",
        "compound": 0.9383,
        "sentiment": "positive"
    },
    {
        "comment": "should i know about machine learning to watch this playlist?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "woo! Thanks!",
        "compound": 0.7639,
        "sentiment": "positive"
    },
    {
        "comment": "I am starting a transition to data science from etl. Can you pls guide",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "Is there any job as sports data scientist? because i am a big football fan and also interested in data science",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "It's very good. How ever,  I try the code, it's not working.",
        "compound": 0.4927,
        "sentiment": "positive"
    },
    {
        "comment": "It will be wonderful",
        "compound": 0.5719,
        "sentiment": "positive"
    },
    {
        "comment": "Can anyone who attended product company interviews/ working as data scientist in product company guide me what topics are must for data scientist  interviews in a product company...",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Also am interested to know the importance of data structure& algos , probability statistics  in these interviews for experienced candidates..",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Sir! please tell me of I am going in the right Direction.",
        "compound": 0.3802,
        "sentiment": "positive"
    },
    {
        "comment": "I had done Training in Machine learning and that training focused less on working with data and more on Algorithms.",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "I stopped learning ML and have heavily focused on working with Data and Understanding it.",
        "compound": 0.1779,
        "sentiment": "positive"
    },
    {
        "comment": "Now I am working on BI and planning to work on ML after it.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Am i on the right track?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "amazing stuff didnt even know i needed this",
        "compound": 0.5859,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, Thanks for your video. I need to do a project and I don't know what topic to choose. Any ideas?. Thanks a lot",
        "compound": 0.7003,
        "sentiment": "positive"
    },
    {
        "comment": "https://www.youtube.com/watch?v=PwBeP0E0Tdw",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "please make a road map video",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "What is the minimum skill to get intothis project? Python, Numpy, pandas, matplotlib all done. Am i good to go to this? Or need more skill like ML?",
        "compound": 0.7366,
        "sentiment": "positive"
    },
    {
        "comment": "You are phenomenal and so is this series! I am primarily a spatial and kinetic learner and for some reason, I'm insane with statistics and probability though I tend to forget the formal terminology and theories that I actually implement. I've been wanting to find a way to learn hands on then get the terminology later on, since I'm in school full time, working full time and beginning my first start up so this series is helpful and simply perfect for my schedule.",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "Hi! I am already following this series and this morning I was reading an article about a man who got an interview from the first data science job he applied for; he started his data science journey by following this series too! The article is by Mario Paul at Towards Data Science titled: \"I Got An Interview From The Only Data Science Job I applied for.\" This is so awesome!",
        "compound": 0.7974,
        "sentiment": "positive"
    },
    {
        "comment": "Okay so I been following your work for few months and I didn't came across this data science project from scratch series but anyway starting from today .",
        "compound": 0.1154,
        "sentiment": "positive"
    },
    {
        "comment": "Ps: I came to know about this from @andrewmomoney channel video on data science bible for 66 daysðŸ’¯ðŸ¤›ðŸ‘",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "That's great!! , I think mastering the skill of working on projects and uploading and using them in making a powerful personal portfolio is the keyword of being professional in the field and getting finding good job , so plz we need more of that staff",
        "compound": 0.9027,
        "sentiment": "positive"
    },
    {
        "comment": "Great Playlist Ken, This is me Fahad from my other channel where I teach Data Science in Arabic, do  have a look at my channel there are some English videos, Thanks man, Keep up the good work",
        "compound": 0.872,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome series. Thanks a lot!",
        "compound": 0.807,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks so much Ken, it's very helpful to outline all the major parts of the project like you did.",
        "compound": 0.8173,
        "sentiment": "positive"
    },
    {
        "comment": "Ken, first of all, thanks a lot for making the series. I wanted to ask your opinion of a fresher (me) doing a project on the credit risk analysis from kaggle. As tons of people have done a lot of work on this already, do you think its worth working on it ? do you think it could be interesting enough to be put on the resume?",
        "compound": 0.8105,
        "sentiment": "positive"
    },
    {
        "comment": "Hi ken, I am struggling to find an affordable desktop computer or laptop ( No more than 400 USD ) that would help me open and use IDEs and other tools fast and comfortably, I would really appreciate it if you could give me your recommendations as my laptop is really slow. Thank you",
        "compound": 0.7408,
        "sentiment": "positive"
    },
    {
        "comment": "My new favorite series on Youtube  :) Thank you Ken JEE",
        "compound": 0.8176,
        "sentiment": "positive"
    },
    {
        "comment": "This is perfect. Please add more like this and explain why you are doing the steps. Most teach but dont explain the reasoning. A series on basic DS projects would be awesome.",
        "compound": 0.8897,
        "sentiment": "positive"
    },
    {
        "comment": "thank you so much for making these videos! Very informative!",
        "compound": 0.4738,
        "sentiment": "positive"
    },
    {
        "comment": "Hello sir thanks for this project. Can you please make a video on datascience project using image datasets",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the great content!",
        "compound": 0.807,
        "sentiment": "positive"
    },
    {
        "comment": "Love this series. This is exactly what I need help with right now. Thank you so much....You're rock Ken :)",
        "compound": 0.9081,
        "sentiment": "positive"
    },
    {
        "comment": "Hey, I just started watching your videos. Great content ! Looking forward to follow this series.",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "FYI: You are awesome !",
        "compound": 0.7861,
        "sentiment": "positive"
    },
    {
        "comment": "hello ken sir,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am having a consulting firm in india for a costing and taxtion work... i have team for the same, I want to start now in new field of data science  as my firm is set and these is really good analytical field which i will like to work on.",
        "compound": 0.7178,
        "sentiment": "positive"
    },
    {
        "comment": "I find your videos really interesting and showing the way ahead . I want to make you my mentor.",
        "compound": 0.5095,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks & Regards,",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Deepali (India)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "If I follow along with the project but do it for different cities in India, do I have permission to put it on my github or does it class as plagiarism. If so, I won't be sharing it online. Of course, I will write about your work,link  and mention the original idea in the Readme. Is it intellectual property theft if done this way?",
        "compound": 0.6599,
        "sentiment": "positive"
    },
    {
        "comment": "i just Beginner i need to understand how to know Business requirement  or how to understand this  Business ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I want to start in kaggle projects ,please recommended for me some project i can solve ,thanks",
        "compound": 0.7964,
        "sentiment": "positive"
    },
    {
        "comment": "Ken we would love to see more series like this . Totally loveddd it !  .",
        "compound": 0.8058,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I want to thank you for your content, I find it really helpful :), Also I had a few questions that I wanted to ask you! what would be a good place to shoot questions? Thanks!",
        "compound": 0.8713,
        "sentiment": "positive"
    },
    {
        "comment": "I love you Ken. I have not paid attention to the series as it is focused on data science (I am a data engineer, just starting though) not when I saw the 5th video of the series then I read the description. There is so much to take away for this. Thanks",
        "compound": 0.88,
        "sentiment": "positive"
    },
    {
        "comment": "what to do when robots.txt show's disallow should you proceed? Cause if you show this to a hiring manager he might take it as a red flag for ethics.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can't thank you enough",
        "compound": -0.2755,
        "sentiment": "negative"
    },
    {
        "comment": "Hey Ken, thank you so much for this. I am currently trying to transition from consulting to data science, but have been really struggling to find ways to demonstrate my knowledge to potential employers. This really helped! Projects don't look like so daunting now!",
        "compound": -0.7676,
        "sentiment": "negative"
    },
    {
        "comment": "Thanks for this wonderful project walk through.  You are my teacher now.",
        "compound": 0.765,
        "sentiment": "positive"
    },
    {
        "comment": "Cool man...",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you Keen for this series ! I\"ll be thankful if I'll see more videos from you ! Good Job Man",
        "compound": 0.9039,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken, the quality of your videos are getting better and I am enjoying this series. thank you for this content!",
        "compound": 0.8439,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you for the Data Science project from scratch videos series.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Just getting into your work. Thank you so much learning more from you than I am in class",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks Jen i am national lawn tennis player and want to be a data scientist the moment I saw you writing tennis I hit the like button ,this is the perfect one for me to startup with",
        "compound": 0.8555,
        "sentiment": "positive"
    },
    {
        "comment": "Please do something on soccer",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Looking forward to part 2 :)",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "This is a great video! Thank you",
        "compound": 0.784,
        "sentiment": "positive"
    },
    {
        "comment": "nice. I am working on my first proper project & would like to see how pros go about it.",
        "compound": 0.6486,
        "sentiment": "positive"
    },
    {
        "comment": "This is real helpful. Thanks for the video :). IÂ´m excited to see the more!.",
        "compound": 0.8122,
        "sentiment": "positive"
    },
    {
        "comment": "discord? only respond with a date! hahaha",
        "compound": 0.2942,
        "sentiment": "positive"
    },
    {
        "comment": "Finally !! Thank you Ken !",
        "compound": 0.5229,
        "sentiment": "positive"
    },
    {
        "comment": "I'm so excited for this series!",
        "compound": 0.4561,
        "sentiment": "positive"
    },
    {
        "comment": "Good work, keep rocking ðŸ¤œðŸ¤›",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "i hope this will help me on my final project.",
        "compound": 0.6808,
        "sentiment": "positive"
    },
    {
        "comment": "waiting for the next video",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Keep it up, thanks for the great content!",
        "compound": 0.807,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks man! Eagerly waiting to end the whole project with you. My first DS project *_*",
        "compound": 0.6996,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I'm glad I stumbled upon your channel. Looking forward to see more of your upcoming videos. Project videos are a great idea, keep it up!",
        "compound": 0.8122,
        "sentiment": "positive"
    },
    {
        "comment": "Another great video. Showing us how to think and plan rather than just spitting out explicit answers. Excited for the future installments.",
        "compound": 0.7579,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you for this addition! I think I want to start with linear regression on premier league soccer and predicting final league standing from early-season information.",
        "compound": 0.4753,
        "sentiment": "positive"
    },
    {
        "comment": "Men! I was waiting for this. Thank you very much!",
        "compound": 0.536,
        "sentiment": "positive"
    },
    {
        "comment": "Instagram Human mimic AI bot.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Using autoencoders to mimmic human behavior.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Data Science Part 2",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Go to kaggle and see the project.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Awesome content! Still relevant in 2024!",
        "compound": 0.6892,
        "sentiment": "positive"
    },
    {
        "comment": "Can't we scrape the data just by using beautifulsoup.. is selenium knowledge is required?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Im getting this error Im struck ..Please help me with this error SeleniumManagerException: Message: Selenium Manager failed for: /Users/mahalakshmirajabattula/Library/Python/3.9/lib/python/site-packages/selenium/webdriver/common/macos/selenium-manager --browser chrome --output json.",
        "compound": -0.7615,
        "sentiment": "negative"
    },
    {
        "comment": "The chromedriver version cannot be discovered",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "It is showing ->",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "Please help",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, Great work @12:35 I got this error \"IndentationError: unindent does not match any outer indentation level\"",
        "compound": 0.2441,
        "sentiment": "positive"
    },
    {
        "comment": "bro you got all modules installed but some people aint got , plz show how to install modules also",
        "compound": -0.0857,
        "sentiment": "negative"
    },
    {
        "comment": "Can anyone here help me with this project",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you so much,finally after a week I completed this video with solving all errors i got ,i learnt so much and learning.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Could you share the link of your background music plz?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "i can't find the glassdoor_scraper module to install, how do i go about it please?",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "i'm having trouble in using the jobs button, can some one help",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I did everything u did at the start but I just couldn't get it to work, I already put the right path for my chromedriver but its not working, it says this error :",
        "compound": -0.6355,
        "sentiment": "negative"
    },
    {
        "comment": "\"TypeError: WebDriver.__init__() got an unexpected keyword argument 'executable_path' \"",
        "compound": -0.3612,
        "sentiment": "negative"
    },
    {
        "comment": "Hello sir, I have a question,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "If we give a list of locations so it will change location by itself after completing scraping of jobs in one location?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am waiting for your response.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you sir for making such a good videos for us.. these are very helpful.",
        "compound": 0.8173,
        "sentiment": "positive"
    },
    {
        "comment": "8:53 you can select the first word of the with a double click and then go to the end of the code and then Shift +  click on the last code you want to select. And there you go. I find this easier.",
        "compound": 0.5499,
        "sentiment": "positive"
    },
    {
        "comment": "I'm stucked in the finding the x part. The structure of glassdoor changed so I updated the class but I still get 'x out failed'",
        "compound": -0.6652,
        "sentiment": "negative"
    },
    {
        "comment": "your position in front of a computer is wrong, care for your health, and thanks for tuts",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken I am not able to see screen clearly now it's bluring",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "In order to copy many lines of code,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "you can highlight the first couple words in the code, then scroll to the end of the code you want to copy.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Then hold shift button and click with the mouse the end of the code.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Should the aspiring data scientists be aware of Web Scapping? Should we learn about selenium and beautiful soup? Or is this the work of a data engineer?",
        "compound": 0.6641,
        "sentiment": "positive"
    },
    {
        "comment": ": 'WebDriver' object has no attribute 'find_elements_by_class_name'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "help >>>",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "When I get to the scraping part I am unable to move on...I get a message saying \"Error Loading , please try again\"...I am doing it on Jupyter notebook....could you plz tell me where I am going wrong",
        "compound": -0.4939,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "On jupyter notebook the error points at",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "--> get_jobs(\"data science \",15, False, 15)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "--> driver.find_element_by_class_name(\"selected\").click()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "AttributeError : 'WebDriver' object has no attribute 'find_element_by_class_name'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "18:46",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "1) Import files 11:30",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Selenium",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "14:30-",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "is the chromedriver at the end important ?",
        "compound": 0.2023,
        "sentiment": "positive"
    },
    {
        "comment": "12:35",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "can you please help how to deal with this? Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "hello sir your explanation is very good but i am getting an error like this ..",
        "compound": 0.2014,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "df = gs.get_jobs('Data Scientist',1000, False, path,15)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File ~\\salary_project\\glassdoor_scraper.py:39 in get_jobs",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.find_element_by_class_name(\"selected\").click()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "AttributeError: 'WebDriver' object has no attribute 'find_element_by_class_name'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Thanks for the video. I use Jupyter nootbook. How to solve such error 'ModuleNotFoundError: No module named 'glassdoor_scraper'?",
        "compound": -0.0516,
        "sentiment": "negative"
    },
    {
        "comment": "'Scraping terminated before reaching target number of jobs' - any leads to solve this error?",
        "compound": -0.058,
        "sentiment": "negative"
    },
    {
        "comment": "though I'm a fresher & could not understand a single code in the whole video, I simply sit back and  watched how simple he is doing his work ??",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "can I use scraping tools like Instant Data Scraper or some other tool for the purpose of data collection?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Lovely playlist Ken!! thanks a lot , as a beginner going through this made me understand the working process!",
        "compound": 0.8213,
        "sentiment": "positive"
    },
    {
        "comment": "Can anyone please share selenium python code, iam not able to fetch the data..",
        "compound": 0.5423,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! I'm a little late here but I'm getting stuck trying to run the initial web scraper and getting the following error after printing 'Progress: 0/15'",
        "compound": -0.3903,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ERROR:ssl_client_socket_impl.cc(996)] handshake failed; returned -1, SSL error code 1, net_error -200",
        "compound": -0.7184,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "x out failed",
        "compound": -0.5106,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What seems to be happening (based on the message and looking at the screen as it attempts to scrape) is that the code is either not properly able to exit from the 'Sign Up' pop-up or maybe it's not able to click on a posting.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I've been scratching my head at this for a while now and I'm really stuck. I'm using your code now directly from your GitHub. Anything you recommend trying? I love this series and am finding it very helpful but would love to follow along.",
        "compound": 0.8898,
        "sentiment": "positive"
    },
    {
        "comment": "Can you please maje another same Blog on web scraping",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks you Sensei Ken jee",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Little complicated but worth watching because I learned a few new things. I couldn't make it run though so moving to the next video and will use your data file. I will come back to this video in the future after I learn some Selenium. Thank you for this unedited video!",
        "compound": 0.6701,
        "sentiment": "positive"
    },
    {
        "comment": "Hello Ken Jee,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "i was trying this code, but in my case the below line is returning a empty list.",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "job_buttons = driver.find_elements_by_class_name(\"jl\")",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "@Ken this content is gold and qualitative in terms of pushing individual horizons to do trial and error and build stuff~",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Anybody who was able to solve the issue of scraping the job_buttons off the current Glass door website please lend your help, the website has changed and it no longer accepts 'jl' as the class name for those elements thanks. :)",
        "compound": 0.8195,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I followed your scrapping process. After following the process you did to get rid of sign up prompt and when I run the scrapping, it gives me the following error",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "\"x out failed",
        "compound": -0.5106,
        "sentiment": "negative"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 5, got 0.\"",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "I really enjoy this natural approach, picking up real examples without preparation, it feels more genuine, great video, thanks",
        "compound": 0.9322,
        "sentiment": "positive"
    },
    {
        "comment": "I'm from Syria and I am working on Data Science Project from Scratch - Part 2 (Data Collection) and I replace the code from driver.find_element_by_class_name(\"ModalStyle__xBtn___29PT9\").click() to  driver.find_element_by_css_selector('[alt=\"Close\"]').click() but the photo will not show ''   Sign In to get instant access to millions of salaries and reviews",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "By continuing, you agree to our Terms of Use and Privacy Policy.\"",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "'and output is  x out failed",
        "compound": -0.5106,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Note : in Syria we need to VBN with glassdoor",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Team or anyone who can guide me how to create a creating a web scraping file",
        "compound": 0.5106,
        "sentiment": "positive"
    },
    {
        "comment": "Great video ! However, is it possible that : \"job_buttons = driver.find_elements_by_class_name(\"jl\")\" does not work anymore ? where did you find it in the HTML code ? if I print the job_button in job_buttons, I get an empty list. thanks a lot !",
        "compound": 0.7989,
        "sentiment": "positive"
    },
    {
        "comment": "Hey, it's not working for Microsoft Edge Browser. Error: AttributeError: module 'selenium.webdriver' has no attribute 'EdgeOptions'",
        "compound": -0.5994,
        "sentiment": "negative"
    },
    {
        "comment": "are anybody getting errors with import glassdoor_scraper as gs?",
        "compound": -0.34,
        "sentiment": "negative"
    },
    {
        "comment": "Hi Ken, Thank you for the video it was very informative. However, I ran into a problem where I ran the code it says \"Scraping terminated before reaching target number of jobs. Needed 15, got 0\". Any advice on this?",
        "compound": 0.2263,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome series! Can you do another series like this- maybe with a more complicated project?",
        "compound": 0.784,
        "sentiment": "positive"
    },
    {
        "comment": "i dislike the programming practices but i love to see people getting passionate about their trade, so for that, i respect ken jee. video's pretty old, i hope u got better with  some of the stuff u do with python, github, etc. lol but that's ok, nbd, i suppose, but it obviously wouldn't hurt and i imagine it's pretty common among people who use programming but are not programmers..  sorry just commenting out-loud.",
        "compound": 0.9921,
        "sentiment": "positive"
    },
    {
        "comment": "for 18:27 which got succeeded in scrapping, mine is getting terminated? what can be the solution?",
        "compound": 0.6662,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, what the steps for creating a web scraping file",
        "compound": 0.296,
        "sentiment": "positive"
    },
    {
        "comment": "I have tried this too many times but the only result I got is \"Scraping terminated before reaching a target number of jobs\".Please if someone can help how to fix it.",
        "compound": 0.7351,
        "sentiment": "positive"
    },
    {
        "comment": "Hi , getting the following error on trying web scrapping, pls help with this",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "<ipython-input-3-9f35248b0e1a>:12: DeprecationWarning: executable_path has been deprecated, please pass in a Service object",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver = webdriver.Chrome(executable_path=path, options=options)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "<ipython-input-3-9f35248b0e1a>:27: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.find_element_by_class_name(\"selected\").click()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "<ipython-input-3-9f35248b0e1a>:33: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.find_element_by_css_selector('[alt=\"Close\"]').click() #clicking to the X..",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "<ipython-input-3-9f35248b0e1a>:40: DeprecationWarning: find_elements_by_* commands are deprecated. Please use find_elements() instead",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "job_buttons = driver.find_elements_by_class_name(\"jobLink\")  #jl for Job Listing. These are the buttons we're going to click.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "x out failed",
        "compound": -0.5106,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Progress: 0/15",
        "compound": 0.4215,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "<ipython-input-3-9f35248b0e1a>:53: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "company_name = driver.find_element_by_xpath('.//div[@class=\"employerName\"]').text",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks Ken for such a informative tutorial",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Could someone help me with this issue?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "Great video Ken! Thank you so much for sharing.",
        "compound": 0.8737,
        "sentiment": "positive"
    },
    {
        "comment": "I feel so satisfied seeing you copy the codes. I thought only freshers does that",
        "compound": 0.5598,
        "sentiment": "positive"
    },
    {
        "comment": "In my case it was not so easy like copy-paste, I found a scrapper from 3 years ago ðŸ˜…ðŸ¤­ i'll should do by myseld, and i think write a blog of something, ðŸ¤”",
        "compound": 0.0914,
        "sentiment": "positive"
    },
    {
        "comment": "Since im in Europe scrapping for me is not working as i think the allow cookies part is stopping it from scrapping, any suggestions on how to bypass that?",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, how did you achieve 12:46 by doing the 11:25 part? Did you create a new file?",
        "compound": 0.3527,
        "sentiment": "positive"
    },
    {
        "comment": "Is it just me or glassdoor has made its html scrape-proof? I tried reproducing the code but I couldn't comprehend how I could access the elements with company name, salary est., location, etc. The elements are just divs with job ids in class name and no extra attributes to access them. Anyone have a workaround, please help? If possible, can anyone share the link with the dataset you scraped because I really want to follow along with the tutorial. Thanks in advance",
        "compound": 0.9118,
        "sentiment": "positive"
    },
    {
        "comment": "Hey, do we need to install anaconda or is just spyder okay?",
        "compound": 0.2263,
        "sentiment": "positive"
    },
    {
        "comment": "Can someone please help understand the below error I am getting,",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "\" Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"} \"",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Ken, I envy your ability to build something of value so quickly. ðŸ¤–",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "Hello, I am trying to use the code to extract information from glassdoor but code is no more working may be due to changes in glassdoor . can you suggest",
        "compound": -0.4215,
        "sentiment": "negative"
    },
    {
        "comment": "As much as I admire this series, blindly making a tutorial where your copy and pasting code as part of a tutorial -- which is aimed at beginner's is not the best way to teach, as more often than not, they won't understand what's going on, selenium is easy enough to read the docs for, this could of been achieved by showing your process how you would do this on your own.",
        "compound": 0.3883,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "After making suggested changes in Glassdoor_scrapper code when I try to import as module in new window but It shows following error \"ModuleNotFoundError: No module named 'glassdoor_scrapper'\". Please help me to address it.",
        "compound": 0.0387,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello Ken Jee, thanks a lot for the playing. It is awesome for newbies like me!",
        "compound": 0.8908,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am trying to follow along with the video, but I get the following error: \"<input>:1: DeprecationWarning: find_element_by_* commands are deprecated. Please use find_element() instead\"",
        "compound": -0.1531,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am trying to replace all \"find_element_by_xpath\" with find_element(by=XPATH, value = xpath) but I cannot figure out how to make it work!",
        "compound": 0.2481,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I would highly appreciate any advice!",
        "compound": 0.5081,
        "sentiment": "positive"
    },
    {
        "comment": "I LIKE YOUR TEACHING WAY BHAI!!",
        "compound": 0.4738,
        "sentiment": "positive"
    },
    {
        "comment": "How to copy multipage code:    ( BTW yours videos are awesome .. like real crispy and to the point )",
        "compound": 0.765,
        "sentiment": "positive"
    },
    {
        "comment": "1. Mouse click on the starting position say .. def",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "2. scroll down ( No mouse selection .. just scroll ) the position to the point  and the click while you hold the shift button..",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "* Please ignore if someone already suggested the same..",
        "compound": -0.0516,
        "sentiment": "negative"
    },
    {
        "comment": "Would be good ot mention that some websites (like glassdoor) are updated all the time and that this script won't work after a while",
        "compound": 0.6597,
        "sentiment": "positive"
    },
    {
        "comment": "Hello Ken",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am running into this error.... please assist",
        "compound": -0.2083,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ModuleNotFoundError: No module named 'glassdoor_scraper'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "AttributeError: module 'glassdoor_scrapper' has no attribute 'get_jobs' ----- this is the error im getting. send help",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Can someone help me with installing the chrome driver?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Could someone help me with this issue?",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Scraping terminated before reaching target number of jobs. Needed 15, got 0.",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you so much for this series! I am planning on transitioning to data science and I'm new to its programming aspects. How did you know what to do at 15:29? I figured that was HTML code. Do I need to learn HTML to be able to spot and fix those errors? Thanks again Ken!",
        "compound": 0.6052,
        "sentiment": "positive"
    },
    {
        "comment": "NoSuchElementException: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=92.0.4515.131)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I'm getting this error during scraping data",
        "compound": -0.481,
        "sentiment": "negative"
    },
    {
        "comment": "@Ken Jee I am facing this error, I googled it but didn't find any solution. I am very new to this so if anyone know how to get done with this.",
        "compound": -0.5432,
        "sentiment": "negative"
    },
    {
        "comment": "no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\"[alt='Close']\"}",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=92.0.4515.131)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "8:52 Ctrl+a selects all the text on a page. That might be a bit anything to clean up though.",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "Hello, I am on Mac using Python 7.22, since this video was made, I am sure there are some changes to the code. I am getting 'str' object has no attribute 'click' as an error on most of the lines ending in .click(). Does anyone have a solution for this? I am fairly new to this and really want to get through the project but have been stuck here for days.",
        "compound": -0.3299,
        "sentiment": "negative"
    },
    {
        "comment": "Thank you for this inside look.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Hello Ken.Can u fix the error of no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\" please. Thank You.",
        "compound": -0.0258,
        "sentiment": "neutral"
    },
    {
        "comment": "print('x out worked')",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "^",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "SyntaxError: invalid syntax",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "why am I having this error? Can someone help me, please",
        "compound": 0.2204,
        "sentiment": "positive"
    },
    {
        "comment": "Sir is it possible to do this complete project  raspberry pi 4??",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi I tried to re create this am getting an exception",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "how do i fix this? any one",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken. Great video. Following along, but it seems Glassdoor changed their class names especially infoEntity from the parser. Any suggestions on how to workaround this?",
        "compound": 0.3716,
        "sentiment": "positive"
    },
    {
        "comment": "whenever i launched selenium it says that it cant locate  element method css selector selector selected",
        "compound": 0.128,
        "sentiment": "positive"
    },
    {
        "comment": "i spent  two days preparing and learing this project and i am stuck at 17:00. i am getting this error Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.745,
        "sentiment": "negative"
    },
    {
        "comment": "if someone has got the solution, let me know. I already searched a lot on internet but didn\"t find solution. i replaced the glassdoor website with indeed.com too but the same error on  indeed. Also i changed the sleep time from 1 up to 500 but still no luck.",
        "compound": -0.4888,
        "sentiment": "negative"
    },
    {
        "comment": "Hi I am getting the error :",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "NoSuchElementException: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=90.0.4430.212)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Have downloaded the correct version of chrome still getting the issue.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Please Help!!",
        "compound": 0.6792,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you for this great video!!! I am trying to scrap data more than 30 rows, it failed when it scraped into page 2. The error shows ElementNotInteractableException: Message: element not interactable",
        "compound": 0.5025,
        "sentiment": "positive"
    },
    {
        "comment": "(Session info: chrome=90.0.4430.212) Does it means this code did not write the case when scrapping more than one page.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi, when I try to run the scraper  I just get stuck on chrome opening with the message \"Chrome is being controlled by automated test software\". I don't know what could be causing this.",
        "compound": -0.25,
        "sentiment": "negative"
    },
    {
        "comment": "i got this error while running: OSError: [WinError 193] %1 is not a valid Win32 application",
        "compound": -0.481,
        "sentiment": "negative"
    },
    {
        "comment": "EDIT: I solved this problem by adding anaconda3 to path variables, but now I can't click the Close button. I tried many ways to do this but since 3 hours I still CAN'T Do this... I surrender.",
        "compound": -0.1312,
        "sentiment": "negative"
    },
    {
        "comment": "Hey ken!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am getting the same error as you got when you changed the 'find_element_BY...'",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "please help me out",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "Hi KenJee!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Firstly I code manually then I got below error and after that I copy & paste your code from GitHub then also I got same error....Can you give solution for me...Thank you so much...",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "Error - NoSuchElementException: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.5994,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=90.0.4430.85)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The fact that you make this video with no cuts, showing us the whole process, trial and error and everything, makes this so unbelievably valuable. There's thousands of data science videos and how tos online, but I've never seen someone who lets me look right over their shoulder during the process. Kudos.",
        "compound": 0.7491,
        "sentiment": "positive"
    },
    {
        "comment": "How did I not know of this before! Brilliant work man. Thank you so much for doing this!",
        "compound": 0.7835,
        "sentiment": "positive"
    },
    {
        "comment": "why keyword is written",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "sir i am getting this type of error....plz help me out",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "import glassdoor_scraper  as gs",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ModuleNotFoundError: No module named 'glassdoor_scraper'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Im guessing since this a bit old now the code doesnt work cuz all class names are different!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello Ken, i'm new to data science, i watched your videos which i find very interesting. i got an error when i try to reproduce your tutorial. the error is << selenium.common.exceptions.NoSuchElementException: Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}>> can you help me solve this problem so that i can continue the tutorial.",
        "compound": -0.4993,
        "sentiment": "negative"
    },
    {
        "comment": "thank you",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Having this error -- NoSuchElementException: Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.5994,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=89.0.4389.114)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "PLEASE HELP",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you. Dying to see a real process that worked",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "9:00, why not just use ctrl + A / cmd + A to copy the whole cell?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi!, I'm having problem to get the data, apparently the problem is arround this line of code when trying to bypass the sing up thing:",
        "compound": -0.69,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "try:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.find_element_by_class_name(\"selected\").click()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I get the error: NoSuchElementException: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.5994,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=89.0.4389.90)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "why does it not find the element?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks in advance!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "can any one tell me what do i have to put in the path variable at 12:12 i dont use chrome",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am always getting this error . Can you help me with that",
        "compound": -0.1091,
        "sentiment": "negative"
    },
    {
        "comment": "NoSuchElementException: Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=89.0.4389.82)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello Ken, Thanks for uploading this helpful series. It is really helping me understand the basics very well! :)",
        "compound": 0.9275,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I had a question about data collection. Is data collection supposed to be a one-time process or does it have to be repeated over when the data in the source has changed? Taking the example of glassdoor, the data around salary will change over time, so how do we decide how often we should re-collect the data? And what if the website structure changes so often and hinders the scraping process? For example, this data scrapper code we referenced doesn't work very well if I run it now as many locators have changed, so I would also have to keep up with the changes in the glassdoor web structure. How to mitigate this problem?",
        "compound": -0.7283,
        "sentiment": "negative"
    },
    {
        "comment": "This is huge; exactly what I was hoping to find because I couldn't visualize what a data science project really even means, where to start, etc - I'm learning on my own. I greatly appreciate the unedited process for tweaking the scraper. That stuff could be passed off as a bullet point \"collect data\", but we all know that even folks that do this daily spend some time going through what you went though in this video.",
        "compound": 0.5494,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "If anyone else is working on a raspberry pi or Linux system, and has issues with selenium.. let me know. I went down a rabbit hole figuring out how to set it up.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Unfortunately this code is broken now. I think Glassdoor has made some changes. For example, class \"jl\" is now \"react-job-listing\". I've made a little progress in making some changes.",
        "compound": -0.4576,
        "sentiment": "negative"
    },
    {
        "comment": "Is this script still working for you? I grabbed the code from your repo. I keep getting a NoSuchElementException \"Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}\"",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey Ken, really good content, thank you so much. There's nothing like these series, looking forward to more of these type of series.",
        "compound": 0.5922,
        "sentiment": "positive"
    },
    {
        "comment": "Tried almost everything but getting this error:  Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}.",
        "compound": -0.7898,
        "sentiment": "negative"
    },
    {
        "comment": "ugh. im not sure what im doing wrong. I keep getting",
        "compound": -0.7822,
        "sentiment": "negative"
    },
    {
        "comment": "selenium.common.exceptions.NoSuchElementException: Message: no such element: Unable to locate element: {\"method\":\"css selector\",\"selector\":\".selected\"}.",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "Does anyone have any idea how to fix?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "At 11:25, How did you go from a fully coded screen to just 5 lines of code when the driver path and other things were typed in? After you said, \"Let's run this\", I have no idea what you did to remove all that code, and just wind up with only 5 lines of code.",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "you can select all the code all at once by holding down 'command/shift'. Just keep holding down command/shift, and the previous code will not deselect.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Loved the video!!!!",
        "compound": 0.7243,
        "sentiment": "positive"
    },
    {
        "comment": "please can someone help me",
        "compound": 0.6124,
        "sentiment": "positive"
    },
    {
        "comment": "i can't install glassdoor package",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "i'm using pip3 and i have python3 install but when i run the pip3 install glassdoor command on my command prompt  i get a verry long error message",
        "compound": -0.5499,
        "sentiment": "negative"
    },
    {
        "comment": "which at the end says invalid syntax",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "How can I install glassdoor scraper?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello Ken, Thank you for this tutorial..",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Need a help..",
        "compound": 0.4019,
        "sentiment": "positive"
    },
    {
        "comment": "\"alt=close\" not working.. cant find close button in the Inspect as well.. please help as to what key to fetch in.. Much Thanks:)",
        "compound": 0.8402,
        "sentiment": "positive"
    },
    {
        "comment": "To copy a full code cell you click in the code cell and use CTRL +  A which would highlight everything the CTRL + C to copy everything. Great vid!",
        "compound": 0.7777,
        "sentiment": "positive"
    },
    {
        "comment": "yeah there's a better and easy way to copy the entire script",
        "compound": 0.7906,
        "sentiment": "positive"
    },
    {
        "comment": "first, off you highlight the entire script by clicking at the beginning of the first line of the script and then scroll down to the end (make sure you don't click anywhere else) now hold the shift key and click at the end of the last line of code (while still holding the shift key)it will then highlight the entire script and now u can press ctrl+c to copy it.",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "this is greater stuff that I have come across I'm new to data science and I spend over a month on youtube trying to get me started with the journey but didn't really find a step by step tutorial as simple and straight forward for a beginner like this channel right here.",
        "compound": 0.7469,
        "sentiment": "positive"
    },
    {
        "comment": "thanks, bro  its really so helpful",
        "compound": 0.7823,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "please can you make a video on git bash and how to connect it to GitHub?",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "the process stops at: \"Progress: 0/15\". No error message whatsoever. :/ Anybody has an idea why?",
        "compound": 0.2635,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I am trying to use your scraper, but it is not scraping, it just shows \"x out worked Progress: 0/15\" and that is it. Do I have to download something else? Im a beginner!",
        "compound": 0.6114,
        "sentiment": "positive"
    },
    {
        "comment": "i got that error",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "from selenium.common.exceptions import NoSuchElementException, ElementClickInterceptedException",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Ken, i'm going through this entire project with you:) As selenium goes through the glass door website i get the error after a few cases saying ElementNotInteractableException ... i have added this error to the webscraper.py and like the other errors added pass but the error is reoccurring....can i get some advice?",
        "compound": -0.7516,
        "sentiment": "negative"
    },
    {
        "comment": "I was facing an issue while scrapping.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Search as per keywords was not happening.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "To tackle that I had to add the following code just below the \"#clicking to the X.\" try block.",
        "compound": -0.4404,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Code :-",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "try:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.find_element_by_id('HeroSearchButton').click()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "except NoSuchElementException:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "pass",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "##I'm just clicking on search before scrapping.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "## Make sure it executes only once",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the content @Ken",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "When scraping the 600th job there is no progress in scraping anymore and when I look into chrome I see a reload button and when I click it by myself then a \"StaleElementReferenceException: stale element reference: element is not attached to the page document\" Error is thrown. But before clicking myself at the reload button, there is no error thrown nor progress anymore. Does anybody knows a solution to that problem?",
        "compound": -0.4985,
        "sentiment": "negative"
    },
    {
        "comment": "Having issues  with the chrome driver",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you for an informative tutorial. I am having the following error while running the code: OSError: [WinError 193] %1 is not a valid Win32 application",
        "compound": -0.0516,
        "sentiment": "negative"
    },
    {
        "comment": "To copy the selenium scraper in one go just go to the first line of the code block and click so that your cursor is flashing, then scroll down to the bottom, once you get there, hold shift and click again and that will highlight everything between the two points where you click with your cursor",
        "compound": -0.128,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Huge time saver :)",
        "compound": 0.6486,
        "sentiment": "positive"
    },
    {
        "comment": "Had some issue understanding the scrapper part because IDE is in dark mode but other than that understood very easily",
        "compound": 0.5483,
        "sentiment": "positive"
    },
    {
        "comment": "Thank youðŸ˜ŠðŸ’¯",
        "compound": 0.8176,
        "sentiment": "positive"
    },
    {
        "comment": "I am not getting salaries in my data frame(It's coming -1 as default)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I did some digging, but I am not getting it.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Please help!!!!!",
        "compound": 0.7326,
        "sentiment": "positive"
    },
    {
        "comment": "** ERROR (HELP)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "When changing the Grey small salary to grey salary still no results.",
        "compound": -0.2023,
        "sentiment": "negative"
    },
    {
        "comment": "Went in and inspected the element it is written as (CSS-1uyte96 CSS-hca4ks e1wijj24) which should be grey salary",
        "compound": 0.0516,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "If anyone has any insight on this and could help I would greatly appreciate it!",
        "compound": 0.7171,
        "sentiment": "positive"
    },
    {
        "comment": "I'm getting some random css number as the span class name (css-1uyte9r css-hca4ks e1wijj242) of the salary estimate. When I'm entering that name in the scraper code, its returning -1. Any idea how to overcome this?",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "Amazing job Ken. I will definitely give you credits for my first project.",
        "compound": 0.8402,
        "sentiment": "positive"
    },
    {
        "comment": "hey, ken wonderful video , i faced an error while copying the data soo many a times i used to get this output  (x out failed) in the middle of the extraction, and then suddenly it just paused at 622 /1000 like didnt pause but its just stuck there idk what to do @ken",
        "compound": -0.4588,
        "sentiment": "negative"
    },
    {
        "comment": "07:38 scraping Jupyter Notebook into Spider IDE ðŸ¤£ðŸ˜‚",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "Hi ken, thank you for the video tutorial. However, my code works in reverse. The 'keyword' search works at the end of the Scrapping. Any help?",
        "compound": 0.6369,
        "sentiment": "positive"
    },
    {
        "comment": "My scrapper gets stuck when getting the data...Any suggestions to resolve??",
        "compound": 0.2406,
        "sentiment": "positive"
    },
    {
        "comment": "All the indian guys trying this project , use the data directly present in the github repo , dont run scrapper coz indian version of glassdoor is a bit differnt imo.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken, amazing content, never come across such a thorough video (especially data scrapping part). Big fan of playingnumbers.com too. Can you make a video of the same type for a data visualization project maybe using tableau.",
        "compound": 0.7269,
        "sentiment": "positive"
    },
    {
        "comment": "cant import glassdoor_scraper as gs. anyone knows why?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hello I wanted to ask that I want data related to job profile- Data Scientist and Job location as Bangalore. When I searched in glassdoor.com the salary for the jobs posted in bangalore is not specified so any help here would be appreciated.",
        "compound": 0.7635,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks Ken!! you are the best. I manage to get my hands dirty. but I am curious about starting up my own scraping using another problem. can I still make use of the same function?",
        "compound": 0.3786,
        "sentiment": "positive"
    },
    {
        "comment": "Great approach for working on a good project. Thanks for sharing. I'll get my hands on it when I master my basics",
        "compound": 0.9136,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken ...Project from scratch series really helps me to understand how does data scientists works on real world project in their companies...Thank you so much for your efforts...very appreciating ... looking for more such kind of projects from you.",
        "compound": 0.6997,
        "sentiment": "positive"
    },
    {
        "comment": "@12:56 how do you run the browser ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "am getting this: WebDriverException: 'chromedriver' executable needs to be in PATH. Please see https://sites.google.com/a/chromium.org/chromedriver/home",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "I do not know why all salary estimate values are repeated,  I followed your video and fix it the same as you then I copy the source code but the salary estimate keeps repeated ,do you have any solution ? Thanks a lot for these videos, they are really helpful.",
        "compound": 0.9151,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome concept for a series!",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "Great Video!!",
        "compound": 0.6892,
        "sentiment": "positive"
    },
    {
        "comment": "This is helpful and enlightening. In my certificate program weâ€™ve been using different tools and add ons to do all this. THIS is much more work but a worthwhile endeavor. It will take some time to get up to speed with github and my coding environment. I was doing coding in a different arena 5 years ago. I hope it informs my ds coding environment",
        "compound": 0.875,
        "sentiment": "positive"
    },
    {
        "comment": "**An easy way to select text** @8:52",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "1. click where the text starts (just place the cursor and click without holding)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "2. scroll down to the end of text",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "3. press and hold Shift then click where the text ends",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Ken I'm curious as to why you prefer spyder over jupyter? Just your preferred editor?",
        "compound": 0.3939,
        "sentiment": "positive"
    },
    {
        "comment": "This is a game changing playlist. By far one of the most valuable lessons to date. Thank you!",
        "compound": 0.7339,
        "sentiment": "positive"
    },
    {
        "comment": "Ken the just scrape the code that scrapes the website so obv bruh",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "use css selectors to get html and use scrapy to scrape.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey Ken! Loved the video as always.",
        "compound": 0.636,
        "sentiment": "positive"
    },
    {
        "comment": "I'm still in college and I am aspiring to be a data scientist later on. I just had a question that considering my current academic condition (year 2) is it all good if I use the code of other users (giving them proper credit of course) for my projects which I intend to present for securing an internship later on?",
        "compound": 0.8481,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "As always, truly appreciate your videos. Keep up the good work of helping us!",
        "compound": 0.8748,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks alot",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Do you have another way of determining the IDE you want to use outside of it being your preference?",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "He ken ! great series",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "When i run the program the data starts fetching but after a few records one more pop up appears and the entire process stops!",
        "compound": -0.2942,
        "sentiment": "negative"
    },
    {
        "comment": "What should i do?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you so much for the video! I followed along. Unfortunately I got the result for Salary all the same values. I am from the USA. I checked Inspect section, made sure that it's still \"gray salary\". Any ideas how I can fix it?",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "hi thank you and keep doing this amazing job and i have question i was doing the same like you but i have problem is spider give this message module not found error can you help me thank yoou",
        "compound": 0.8857,
        "sentiment": "positive"
    },
    {
        "comment": "Downloading ipynb from github as py file -",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Loading Public Notebooks Directly from GitHub in google colab:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "https://colab.research.google.com/github/googlecolab/colabtools/blob/master/notebooks/colab-github-demo.ipynb#scrollTo=K-NVg7RjyeTk",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "From colab you can then just download the ipynb file as py file... Saves a lot of hassles.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "guys this error message is hard to crack. help please",
        "compound": 0.2263,
        "sentiment": "positive"
    },
    {
        "comment": "ElementClickInterceptedException: Message: element click intercepted: Element <li class=\"jl react-job-listing gdGrid selected\" data-id=\"3606797381\" data-emp-id=\"1309610\" data-is-organic-job=\"false\" data-ad-order-id=\"1060438\" data-sgoc-id=\"1019\" data-is-easy-apply=\"false\" data-normalize-job-title=\"Data Scientist\" data-job-loc=\"San Francisco, CA\" data-job-loc-id=\"1147401\" data-job-loc-type=\"C\" data-njslv=\"false\" style=\"\">...</li> is not clickable at point (216, 248). Other element would receive the click: <div class=\"background-overlay\" aria-label=\"Background Overlay\"></div>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=84.0.4147.105)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "hey where can i get raw data, which you scraped",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi , There  :",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "is it needed to know selenium ??",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey, great series! I am not able to fetch salary data in glassdoor of my country. It's not showing there, can you suggest a way around. Th",
        "compound": 0.6588,
        "sentiment": "positive"
    },
    {
        "comment": "I know we didn't sign any contract lol , but it is a big honor being your student , i'm learning so much from you , thank you so much !",
        "compound": 0.8671,
        "sentiment": "positive"
    },
    {
        "comment": "Hi ken, I got problem after execute the code. it said that 'x out failed'. can u suggest me what's wrong with my code?",
        "compound": -0.8442,
        "sentiment": "negative"
    },
    {
        "comment": "i have problem with glassdoor_scrapper module. it said that there is no module in there. what should i do about that?",
        "compound": -0.5994,
        "sentiment": "negative"
    },
    {
        "comment": "Hey Ken!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am facing a problem while importing glassdoor_scraper. Hope to hear a solution from you about it.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "hey, ken I'm facing trouble regarding salary, all the salaries in the data frame are the same as the first one, can u help?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hey, Ken why you prefer spyder than Jupiter notebook...which one I should go for? any suggestions!",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Anyone encountered the  ElementClickInterceptedException: Message: element click intercepted: Element <div class=\"tab\" data-test=\"tab\" data-tab-type=\"overview\">...</div> is not clickable at point (547, 475). Other element would receive the click: <p id=\"onetrust-policy-text\">...</p>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=83.0.4103.116) ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Great video Ken!!",
        "compound": 0.6892,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "*Solution to the error messages*",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I made these two changes to the scraper file and now it runs all OK.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "1. JOB button:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Replaced job_button.click() with",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.execute_script(\"arguments[0].click();\", job_button)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "2. NEXT button:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Replaced  driver.find_element_by_xpath('.//li[@class=\"next\"]//a').click() with",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "next_button=driver.find_element_by_xpath('.//li[@class=\"next\"]//a');",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.execute_script(\"arguments[0].click();\", next_button)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "When I also put the Job title keyword as \"Data Scientist\", and run the program, the glassdoor Job search bar only shows first 5 character as \"datas\". Can't seem to understand why this is happening? I have also tried with the other keywords like Analyst -  even here it  just shows first 5 character as Analy. Can you help why this is happening?",
        "compound": 0.6767,
        "sentiment": "positive"
    },
    {
        "comment": "selenium.common.exceptions.ElementNotInteractableException: Message: element not interactable: element has zero size  (Session info: chrome=83.0.4103.116)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I am getting this error every time I run this model.",
        "compound": -0.481,
        "sentiment": "negative"
    },
    {
        "comment": "Thank you for making these excellent series, very well structured!",
        "compound": 0.8353,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you so much for this series, it's really helpful for beginners like me. I have a question though, I followed almost exactly how you revised the codes, the only difference is probably that I am using data from both Canada and USA, and the \"salary estimate\" column shows all identical values (e.g. CA$89K-CA$100K (Glassdoor Est.)) but all the other columns (e.g. rating, company name) are just fine. This is so confusing to me since the codes formats for reading \"estimate salary\" and \"rating\" are the same. Any insights you can share why this occurs? Thank you so much.",
        "compound": 0.8559,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you Ken for such a wonderful tutorial, it was easy to follow and simple for a beginner to keep up with. I have been scraping Data Science jobs in Canada and they are less than 1000. My num_jobs variable is 1000. So, what is happening is when the scraper reached the last page on glassdoor it is going in a loop and collecting data from the same 5 jobs over and over, I guess it will do that till the length of jobs dictionary reached 1000. What can I do to make it stop once there are no new jobs?",
        "compound": 0.7579,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks for the great video! Just out of curiosity, is it illegal to scrape data online with selenium and BeautifulSoup for a project?",
        "compound": 0.5707,
        "sentiment": "positive"
    },
    {
        "comment": "Ken, you are the G.O.A.T.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I recently started to learn python and its application in data analysis, but I was struggling with getting the data in the first place.",
        "compound": -0.5719,
        "sentiment": "negative"
    },
    {
        "comment": "This series is awesome! keep up your good work",
        "compound": 0.807,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you veryy much for such an amazing project!! You have covered end to end of this project and it is very very helpful for beginners like me! Thank you so much ðŸ˜Š",
        "compound": 0.9675,
        "sentiment": "positive"
    },
    {
        "comment": "Why this is so fun to watch :D",
        "compound": 0.8509,
        "sentiment": "positive"
    },
    {
        "comment": "****Solution to one of the problem that I ran to ****",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "Error :  ElementNotInteractableException: element not interactable: element has zero size (Session info: chrome=83.0.4103.97)",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Just replace the line",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "job_button.click()  #You might  [ Line number around 63 ]",
        "compound": 0.0772,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "with",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver.execute_script(\"arguments[0].click();\", job_button)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I just scraped my 1000 job posts without this nagging error.",
        "compound": 0.59,
        "sentiment": "positive"
    },
    {
        "comment": "Cheers !!!",
        "compound": 0.6093,
        "sentiment": "positive"
    },
    {
        "comment": "You can easily select and copy code on GitHub by clicking 'Raw' when you view the file, then press CTRL+A and CTRL+C to select and copy it before pressing CTRL+V to paste it into your editor.",
        "compound": 0.34,
        "sentiment": "positive"
    },
    {
        "comment": "Thanks a lot for this Ken, loving the raw approach!!",
        "compound": 0.8118,
        "sentiment": "positive"
    },
    {
        "comment": "Also you could've just downloaded the Jupiter notebook as a .py file.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Looking forward to this.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Cheers!",
        "compound": 0.5255,
        "sentiment": "positive"
    },
    {
        "comment": "Ken Jee thank you for this video. Iâ€™m just. Beginner and while Iâ€™m trying to run the code I keep getting the following error even though selenium is already installed.",
        "compound": -0.0516,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ModuleNotFoundError: no module named â€˜seleniumâ€™",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I tried manually installing selenium by unpacking the taz file, still the error is there. What has gone wrong?",
        "compound": -0.7003,
        "sentiment": "negative"
    },
    {
        "comment": "How do we know when to stop.the scraper",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do we actually need to know the purpose of each line  of copied Selenium code or we can just copy and paste it as it is ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "thank you Ken",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "HI Ken I am getting X out failed ,while scrapping",
        "compound": -0.5106,
        "sentiment": "negative"
    },
    {
        "comment": "Hi Ken! I tried to use 'Business Analyst' instead of 'Data Scientist'. When I reached 167/1000, i got this error:",
        "compound": -0.4619,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ElementNotInteractableException: element not interactable: element has zero size",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=83.0.4103.97)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Do you have any idea how to solve this? Thanks in advance!",
        "compound": 0.667,
        "sentiment": "positive"
    },
    {
        "comment": "selenium module error on python3? please help",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! I'm a little late here but I'm getting stuck trying to run the initial web scraper and getting the following error after printing 'Progress: 0/15'",
        "compound": -0.3903,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ElementClickInterceptedException: Message: element click intercepted: Element <li class=\"jl react-job-listing gdGrid selected\" data-id=\"3343053790\" data-emp-id=\"1309610\" data-is-organic-job=\"false\" data-ad-order-id=\"919804\" data-sgoc-id=\"1019\" data-is-easy-apply=\"false\" data-normalize-job-title=\"Data Scientist\" data-job-loc=\"San Francisco, CA\" data-job-loc-id=\"1147401\" data-job-loc-type=\"C\" data-njslv=\"false\" style=\"\">...</li> is not clickable at point (216, 292). Other element would receive the click: <div class=\"background-overlay\" aria-label=\"Background Overlay\"></div>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=83.0.4103.61)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "What seems to be happening (based on the message and looking at the screen as it attempts to scrape) is that the code is either not properly able to exit from the 'Sign Up' pop-up or maybe it's not able to click on a posting.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I've been scratching my head at this for a while now and I'm really stuck. I'm using your code now directly from your GitHub. Anything you recommend trying? I love this series and am finding it very helpful but would love to follow along.",
        "compound": 0.8898,
        "sentiment": "positive"
    },
    {
        "comment": "It could be better to just download the notebook and convert it to .py https://stackoverflow.com/questions/17077494/how-do-i-convert-a-ipython-notebook-into-a-python-file-via-commandline",
        "compound": 0.4404,
        "sentiment": "positive"
    },
    {
        "comment": "Just cause you asked :  There is a suggestion - Why did you not select raw format and copy from there ?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Am new to the DS environment and the setting up of the repo and all had already overwhelm me.  And the nitty gritty details to amend the code.  Hope I am able to digest and pick up as I continue my upskilling",
        "compound": 0.296,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken! What keyboard shortcut did you click to run the program at 20:29 where it showed the Chrome browser opening?",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi Ken! I love all your tutorials but in this one I am facing some problems. I keep getting the error 'ModuleNotFoundError: No module named 'selenium' ' on the console.",
        "compound": -0.8221,
        "sentiment": "negative"
    },
    {
        "comment": "Hey Ken, I'm getting the following error when I run the file :",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "ElementNotInteractableException: element not interactable: element has zero size",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=83.0.4103.61)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can you suggest a solution please?",
        "compound": 0.5574,
        "sentiment": "positive"
    },
    {
        "comment": "First of all, thank you for your great content. Beautifully explained. I came across an issue, when I run data_collection.py after progress 44/1000, it shows the following errors:",
        "compound": 0.8934,
        "sentiment": "positive"
    },
    {
        "comment": "selenium.common.exceptions.ElementNotInteractableException: Message: element not interactable: element has zero size",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=83.0.4103.61)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Can you please help. I tried slack but still stuck.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thank you again for your content.",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Really appreciated !!!",
        "compound": 0.6672,
        "sentiment": "positive"
    },
    {
        "comment": "Thank you very much. The way you faced and solved the bugs is unique and inspirational. Some other videos out there are too well-prepared, which is easy to delude people into the perfectness of the code. Consequently, if the code somehow does not run, people don't know how to solve. Please keep this style.",
        "compound": 0.9509,
        "sentiment": "positive"
    },
    {
        "comment": "I am not sure if this is legal cause the robots.txt file at LinkedIn disallows everything on jobs. Mostly every useful data to scrap is disallowed.",
        "compound": 0.3481,
        "sentiment": "positive"
    },
    {
        "comment": "For other people - if you have the remote URL permission problem(?) with SSH (26:35), this website could help you. https://help.github.com/en/github/using-git/changing-a-remotes-url",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I got the same Salary Estimate values from start to end... I don't know why and it's really a pain in the ass",
        "compound": -0.6573,
        "sentiment": "negative"
    },
    {
        "comment": "Thank you so much for posting! I am learning so much, especially what I don't know. and need to learn for my current data project. I'm changing my career to be a data scientist (well aiming for data analyst for now and I'll build up more skills to transfer to data science). It's quite exciting!",
        "compound": 0.8261,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken, really appreciate your effort.",
        "compound": 0.4576,
        "sentiment": "positive"
    },
    {
        "comment": "I am facing a problem though. Since, i am an Indian user, the website is being redirected to Indian version of the web page and Indian version lacks salary on top where company name, position and location is mentioned.",
        "compound": -0.2263,
        "sentiment": "negative"
    },
    {
        "comment": "What can i do to solve this?",
        "compound": 0.2023,
        "sentiment": "positive"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "p.s: Also, while redirecting it gives an option to undo it, but as soon as undo it, the scrapping process gets terminated with an error KeyboardInterrupt.",
        "compound": -0.5499,
        "sentiment": "negative"
    },
    {
        "comment": "I don't usually comment on youtube videos, but this series is simply amazing! It's often difficult to find content on data cleaning and model production, so this project series will benefit me a ton. Quick question- what is the best way to go about modifying the scraper so that it can scrape a much larger dataset (i.e. 5000 or 10000 data points)?",
        "compound": 0.933,
        "sentiment": "positive"
    },
    {
        "comment": "It seems my web scraper isn't scrolling down to access new postings.  It will successfully scrape the first handful (up to 15) and then spit out this error:",
        "compound": 0.0194,
        "sentiment": "neutral"
    },
    {
        "comment": "ElementNotInteractableException: element not interactable: element has zero size",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The error appears to be coming from line 61:  job_button.click()",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "Does anyone know how to deal with this?  I am new to web scraping.",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "You can copy the entire code from Jupiter Notebook by clicking, holding, and scrolling. :)",
        "compound": 0.4588,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I started web scraping and made necessary changes to retrieve estimate_salary as Described in the video, but I failed. By the way, you have inspired a lot to me man, thank you so much. Keep posting great content, very excited for upcoming content.",
        "compound": 0.923,
        "sentiment": "positive"
    },
    {
        "comment": "I was using the jupyter notebook on Mozilla and Iâ€™m getting the driver error again and again. I tried to fix it but it shows unicodeescape error",
        "compound": -0.6597,
        "sentiment": "negative"
    },
    {
        "comment": "The text small and hard to see.",
        "compound": -0.1027,
        "sentiment": "negative"
    },
    {
        "comment": "Hi Ken, we're you able to scrape the 1000 jobs in one shot,  because I kept getting an error of 'element click intercepted' after the script went through a few job posts. And I googled the world and couldn't find what that error meant. Thanks for your videos they're great.",
        "compound": 0.3818,
        "sentiment": "positive"
    },
    {
        "comment": "Try to use the \"Raw\" button if there's one on top of the editor within the page where you want to get the code from",
        "compound": 0.2732,
        "sentiment": "positive"
    },
    {
        "comment": "hey man, i'm from Brasil, and i'm starting a project of soccer data analysis. Your videos are realy helping me out! Thank you!",
        "compound": 0.6467,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Everyone, can anyone please assist with this error:",
        "compound": -0.2083,
        "sentiment": "negative"
    },
    {
        "comment": "StaleElementReferenceException: stale element reference: element is not attached to the page document",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=81.0.4044.138)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I don't get this error unless I try to scrape a large number of jobs, which is weird.",
        "compound": -0.5461,
        "sentiment": "negative"
    },
    {
        "comment": "I am an absolute beginner. All this years i realised i always learnt the theory first ,the details first but i wanted to try if i can look up into a project and build curiosity and then work on basics. This really helped. Thank you. Regards , mech. Engineer.",
        "compound": 0.5672,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken Jee, this is great tutorials! thank you so much !! that's what i'm looking for !!",
        "compound": 0.8302,
        "sentiment": "positive"
    },
    {
        "comment": "he Ken Jee, thnx 4 the great tutorials! really loving them.. I'm trying to replicate what you did as a way of learning (i'm still in the learning phase of programming), however when i load the page, i get a ' cookie - consent' pop-up! As a result the scraping doesn't continue (however, when i manually press 'accept cookies' it does continue). Do you know a way i can hard code this in python so that when the page opens, it automatically excepts the cookies too?",
        "compound": 0.9182,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, thanks for the series! I'm currently at @23.50. Around halfway through running the iterations I'm receiving an error saying the element is not clickable at point (219, 653). Other elements would receive the click: <div class=\"gdGrid noPad\">. Do you know why?",
        "compound": 0.126,
        "sentiment": "positive"
    },
    {
        "comment": "yes I have downloaded chrome driver and saved in same folder. But chrome driver is 32bit and my laptop is 64 bit support. Please help as I'm beginner and I find really interesting your channel.",
        "compound": 0.95,
        "sentiment": "positive"
    },
    {
        "comment": "File \"C:\\Users\\Shukla\\Documents\\ds_salary_proj\\glassdoor_scraper.py\", line 13, in get_jobs",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "options = webdriver.ChromeOptions()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "NameError: name 'webdriver' is not defined",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Sir I'm getting this error again and again. Please help me out",
        "compound": 0.2204,
        "sentiment": "positive"
    },
    {
        "comment": "File \"C:/Users/Shukla/Documents/Glassdoor/start1.py\", line 8, in <module>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "import glassdoor_scraper as gs",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Shukla\\Documents\\Glassdoor\\glassdoor_scraper.py\", line 12",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "In [15]:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "^",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "SyntaxError: invalid syntax",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "i am getting this error",
        "compound": -0.481,
        "sentiment": "negative"
    },
    {
        "comment": "Hey Ken,  really good content as always, keep the projects coming! One question, I was trying to run the script and for some reason the Salary fields were all coming in as the same salary estimate (usually the first job that was copied). Any reason why you could see this being the case.",
        "compound": 0.54,
        "sentiment": "positive"
    },
    {
        "comment": "Hi kenn  I tried running the code in Google colab , and have even specified the path of chrome driver in environment variable ,found the following error:",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "PS: I have downloaded the latest chrome driver wrt to the chrome update,and have specified the exact path .",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "FileNotFoundError                         Traceback (most recent call last)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "/usr/local/lib/python3.6/dist-packages/selenium/webdriver/common/service.py in start(self)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "75                                             stderr=self.log_file,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "---> 76                                             stdin=PIPE)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "77         except TypeError:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "5 frames",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "FileNotFoundError: [Errno 2] No such file or directory: 'C:/Users/projects/chromedriver': 'C:/Users/projects/chromedriver'",
        "compound": -0.296,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "During handling of the above exception, another exception occurred:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "WebDriverException                        Traceback (most recent call last)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "/usr/local/lib/python3.6/dist-packages/selenium/webdriver/common/service.py in start(self)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "81                 raise WebDriverException(",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "82                     \"'%s' executable needs to be in PATH. %s\" % (",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "---> 83                         os.path.basename(self.path), self.start_error_message)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "84                 )",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "85             elif err.errno == errno.EACCES:",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "WebDriverException: Message: 'chromedriver' executable needs to be in PATH. Please see https://sites.google.com/a/chromium.org/chromedriver/home",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, I'm receiving this error when I'm trying to run the program at [12:52]:",
        "compound": -0.481,
        "sentiment": "negative"
    },
    {
        "comment": "\"File \"C:\\Users\\Niccolo\\Documents\\ds_salary_proj\\executing code.py\", line 14, in <module>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "df = gs.get_jobs('data scientist', 15, False, path, 15)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\Documents\\ds_salary_proj\\glassdoor_scraper.py\", line 18, in get_jobs",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "driver = webdriver.Chrome(executable_path=path, options=options)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\anaconda3\\lib\\site-packages\\selenium\\webdriver\\chrome\\webdriver.py\", line 73, in __init__",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "self.service.start()",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\anaconda3\\lib\\site-packages\\selenium\\webdriver\\common\\service.py\", line 76, in start",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "stdin=PIPE)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\anaconda3\\lib\\site-packages\\spyder_kernels\\customize\\spydercustomize.py\", line 104, in __init__",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "super(SubprocessPopen, self).__init__(*args, **kwargs)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\anaconda3\\lib\\subprocess.py\", line 800, in __init__",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "restore_signals, start_new_session)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "File \"C:\\Users\\Niccolo\\anaconda3\\lib\\subprocess.py\", line 1207, in _execute_child",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "startupinfo)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "OSError: [WinError 193] %1 is not a valid Win32 application\"     <--------- ERROR",
        "compound": -0.5319,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Would you know a possible fix for this? Thanks always for your great content",
        "compound": 0.8164,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken, really good content, thank you so much. Just wanted to suggest a change, I guess the jobs.append code in the bottom part is supposed to be outside the if condition, by mistake you put it inside. :)",
        "compound": 0.762,
        "sentiment": "positive"
    },
    {
        "comment": "Hi Ken, good video as always.  I was working on this tutorial and the scrap file worked fine yesterday. I tried scrapping more data today however the \"glassdoor_scraper.py\" file started to return an error every time I run the \"data_collection.py\" file. Perhaps glassdoor made changes on their website. I tried cloning your project from Github and it gave the same error. Could you look into this?",
        "compound": -0.1779,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Error:",
        "compound": -0.4019,
        "sentiment": "negative"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "ElementClickInterceptedException: element click intercepted: Element <li class=\"jl react-job-listing gdGrid \" data-id=\"2952230826\" data-emp-id=\"1405209\" data-is-organic-job=\"true\" data-ad-order-id=\"894020\" data-sgoc-id=\"1007\" data-is-easy-apply=\"true\" data-normalize-job-title=\"Electrical Designer\" data-job-loc=\"Middletown, PA\" data-job-loc-id=\"1152197\" data-job-loc-type=\"C\" data-njslv=\"false\">...</li> is not clickable at point (217, 869). Other element would receive the click: <div class=\"gdGrid noPad\">...</div>",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "(Session info: chrome=81.0.4044.92)",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks Ken!",
        "compound": 0.4926,
        "sentiment": "positive"
    },
    {
        "comment": "Hi! What text editor do you use for Git? Vim",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Thanks!! Subscribed",
        "compound": 0.5399,
        "sentiment": "positive"
    },
    {
        "comment": "followed this through and get an error - TypeError: get_jobs() missing 2 required positional arguments: 'path' and 'slp_time'. not clear i have these variables set properly. thanks.",
        "compound": -0.7081,
        "sentiment": "negative"
    },
    {
        "comment": "Hi Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "I really like the Video and looking forward to this series. One question i want to ask you is that can i add this project to my resume.",
        "compound": 0.4754,
        "sentiment": "positive"
    },
    {
        "comment": "Please reply back to my question.",
        "compound": 0.3182,
        "sentiment": "positive"
    },
    {
        "comment": "You're a star. This is a great eye-opener.",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Ken,",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "The Data Science project series is amazing and much needed.",
        "compound": 0.5859,
        "sentiment": "positive"
    },
    {
        "comment": "Quick question: Just like we used 'keyword' for searching with job title, what would be the change in code if location too needs a keyword search?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "Awesome vid",
        "compound": 0.6249,
        "sentiment": "positive"
    },
    {
        "comment": "Hello is very good your channel, is possible get some remote job of data science or data analisis",
        "compound": 0.4927,
        "sentiment": "positive"
    },
    {
        "comment": "Can we use web scrapping tool like (parsehub) for data collection?",
        "compound": 0.3612,
        "sentiment": "positive"
    },
    {
        "comment": "thank you for the video! one question though: say this came up during an interview and I was tasked with making a scraper. Would it be OK to say to use someone else's code and provide credit for it? look forward to seeing this entire series as I'm currently in my own project-building phase for my data scientist career transition.",
        "compound": 0.8087,
        "sentiment": "positive"
    },
    {
        "comment": "This is my first comment on youtube since I am using computer/Internet and It's for you Ken. You have started such a great super awesome series ( Data Science Project from Scratch ) that most of youtubers have'nt and I love it. You are such a great man.  Your Videos are very informative. I believe this series will give your channel more and more subscribers.",
        "compound": 0.9698,
        "sentiment": "positive"
    },
    {
        "comment": "Loving this series! Really enjoyed this \"buying ingredients\" process! :p",
        "compound": 0.8772,
        "sentiment": "positive"
    },
    {
        "comment": "There's nothing quite like a video that shows the raw process and is practical! Thanks a ton Ken, looking forward to the rest of the series--especially the data cleaning!",
        "compound": 0.2863,
        "sentiment": "positive"
    },
    {
        "comment": "I would think that a database containing the relevant data would exist and then we could see some SQL action",
        "compound": 0.0,
        "sentiment": "neutral"
    },
    {
        "comment": "Hi, Ken! Is it possible to use ipad when doing data science? Thank you!",
        "compound": 0.4738,
        "sentiment": "positive"
    },
    {
        "comment": "Hey Everyone - I hope you enjoyed the video! Stay tuned for Part 3: Data Cleaning that will be coming out on Wednesday 4/8. I am loving the questions and comments so far, so please keep them coming!",
        "compound": 0.9326,
        "sentiment": "positive"
    },
    {
        "comment": "I loved the video.",
        "compound": 0.5994,
        "sentiment": "positive"
    }
]